(function(){function r(e,n,t){function o(i,f){if(!n[i]){if(!e[i]){var c="function"==typeof require&&require;if(!f&&c)return c(i,!0);if(u)return u(i,!0);var a=new Error("Cannot find module '"+i+"'");throw a.code="MODULE_NOT_FOUND",a}var p=n[i]={exports:{}};e[i][0].call(p.exports,function(r){var n=e[i][1][r];return o(n||r)},p,p.exports,r,e,n,t)}return n[i].exports}for(var u="function"==typeof require&&require,i=0;i<t.length;i++)o(t[i]);return o}return r})()({1:[function(require,module,exports){
(function (global){(function (){
var transliteration;

if (typeof global !== "undefined" && global.transliteration) {
    transliteration = global.transliteration;
} else {
    global.transliteration = transliteration = {};
}

transliteration.crh = require('./transliteration.crh').crh;
transliteration.crh.version = require('../package').version;

}).call(this)}).call(this,typeof global !== "undefined" ? global : typeof self !== "undefined" ? self : typeof window !== "undefined" ? window : {})

},{"../package":5,"./transliteration.crh":4}],2:[function(require,module,exports){
module.exports = ([
    [ /“/g, "\"" ],
    [ /”/g, "\"" ],
    // 0. словарик
    // 0.1. слова на -аль
    // -иаль
    [ /ial/g, "иаль" ],
    [ /İAL/g, "ИАЛЬ" ],
    // актуаль
    [ /aktual/g, "актуаль" ],
    [ /Aktual/g, "Актуаль" ],
    [ /AKTUAL/g, "АКТУАЛЬ" ],
    // диагональ
    [ /diagonal/g, "диагональ" ],
    [ /Diagonal/g, "Диагональ" ],
    [ /DİAGONAL/g, "ДИАГОНАЛЬ" ],
    // эмсаль
    [ /emsal/g, "эмсаль" ],
    [ /Emsal/g, "Эмсаль" ],
    [ /EMSAL/g, "ЭМСАЛЬ" ],
    // фааль
    [ /faal/g, "фааль" ],
    [ /Faal/g, "Фааль" ],
    [ /FAAL/g, "ФААЛЬ" ],
    // феодаль
    [ /feodal/g, "феодаль" ],
    [ /Feodal/g, "Феодаль" ],
    [ /FEODAL/g, "ФЕОДАЛЬ" ],
    // горизонталь
    [ /gorizontal/g, "горизонталь" ],
    [ /Gorizontal/g, "Горизонталь" ],
    [ /GORİZONTAL/g, "ГОРИЗОНТАЛЬ" ],
    // документаль
    [ /dokumental/g, "документаль" ],
    [ /Dokumental/g, "Документаль" ],
    [ /DOKUMENTAL/g, "ДОКУМЕНТАЛЬ" ],
    // фестиваль
    [ /festival/g, "фестиваль" ],
    [ /Festival/g, "Фестиваль" ],
    [ /FESTİVAL/g, "ФЕСТИВАЛЬ" ],
    // хроникаль
    [ /hronikal/g, "хроникаль" ],
    [ /Hronikal/g, "Хроникаль" ],
    [ /HRONİKAL/g, "ХРОНИКАЛЬ" ],
    // идеаль
    [ /ideal/g, "идеаль" ],
    [ /İdeal/g, "Идеаль" ],
    [ /İDEAL/g, "ИДЕАЛЬ" ],
    // инструменталь
    [ /instrumental/g, "инструменталь" ],
    [ /İnstrumental/g, "Инструменталь" ],
    [ /İNSTRUMENTAL/g, "ИНСТРУМЕНТАЛЬ" ],
    // икъмаль
    [ /iqmal/g, "икъмаль" ],
    [ /İqmal/g, "Икъмаль" ],
    [ /İQMAL/g, "ИКЪМАЛЬ" ],
    // икъбаль
    [ /iqbal/g, "икъбаль" ],
    [ /İqbal/g, "Икъбаль" ],
    [ /İQBAL/g, "ИКЪБАЛЬ" ],
    // истикъбаль
    [ /istiqbal/g, "истикъбаль" ],
    [ /İstiqbal/g, "Истикъбаль" ],
    [ /İSTİQBAL/g, "ИСТИКЪБАЛЬ" ],
    // истикъляль
    [ /istiqlâl/g, "истикъляль" ],
    [ /İstiqlâl/g, "Истикъляль" ],
    [ /İSTİQLÂL/g, "ИСТИКЪЛЯЛЬ" ],
    // итъалят
    [ /([\s"'\(\)\-.,:;!?>\]/])italât/g, "$1итъалят" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])İtalât/g, "$1Итъалят" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])İTALÂT/g, "$1ИТЪАЛЯТ" ],
    // итъаль
    [ /([\s"'\(\)\-.,:;!?>\]/])ital/g, "$1итъаль" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])İtal/g, "$1Итъаль" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])İTAL/g, "$1ИТЪАЛЬ" ],
    // Италия
    [ /итъальiya/g, "италия" ],
    [ /Итъальiya/g, "Италия" ],
    [ /ИТЪАЛЬİYA/g, "ИТАЛИЯ" ],
    [ /итъальya/g, "италья" ],
    [ /Итъальya/g, "Италья" ],
    [ /ИТЪАЛЬYA/g, "ИТАЛЬЯ" ],
    // ишгъаль
    [ /işğal/g, "ишгъаль" ],
    [ /İşğal/g, "Ишгъаль" ],
    [ /İŞĞAL/g, "ИШГЪАЛЬ" ],
    // кафедраль
    [ /kafedral/g, "кафедраль" ],
    [ /Kafedral/g, "Кафедраль" ],
    [ /KAFEDRAL/g, "КАФЕДРАЛЬ" ],
    // казуаль
    [ /kazual/g, "казуаль" ],
    [ /Kazual/g, "Казуаль" ],
    [ /KAZUAL/g, "КАЗУАЛЬ" ],
    // коллегиаль
    [ /kollegial/g, "коллегиаль" ],
    [ /Kollegial/g, "Коллегиаль" ],
    [ /KOLLEGİAL/g, "КОЛЛЕГИАЛЬ" ],
    // колоссаль
    [ /kolossal/g, "колоссаль" ],
    [ /Kolossal/g, "Колоссаль" ],
    [ /KOLOSSAL/g, "КОЛОССАЛЬ" ],
    // коммуналь
    [ /kommunal/g, "коммуналь" ],
    [ /Kommunal/g, "Коммуналь" ],
    [ /KOMMUNAL/g, "КОММУНАЛЬ" ],
    // кардиналь
    [ /kardinal/g, "кардиналь" ],
    [ /Kardinal/g, "Кардиналь" ],
    [ /KARDİNAL/g, "КАРДИНАЛЬ" ],
    // криминаль
    [ /kriminal/g, "криминаль" ],
    [ /Kriminal/g, "Криминаль" ],
    [ /KRİMİNAL/g, "КРИМИНАЛЬ" ],
    // легаль
    [ /legal/g, "легаль" ],
    [ /Legal/g, "Легаль" ],
    [ /LEGAL/g, "ЛЕГАЛЬ" ],
    // леталь
    [ /letal/g, "леталь" ],
    [ /Letal/g, "Леталь" ],
    [ /LETAL/g, "ЛЕТАЛЬ" ],
    // либераль
    [ /liberal/g, "либераль" ],
    [ /Liberal/g, "Либераль" ],
    [ /LİBERAL/g, "ЛИБЕРАЛЬ" ],
    // локаль
    [ /lokal/g, "локаль" ],
    [ /Lokal/g, "Локаль" ],
    [ /LOKAL/g, "ЛОКАЛЬ" ],
    // мааль
    [ /maal([^e])/g, "мааль$1" ],
    [ /Maal([^e])/g, "Мааль$1" ],
    [ /MAAL([^E])/g, "МААЛЬ$1" ],
    // магистраль
    [ /magistral/g, "магистраль" ],
    [ /Magistral/g, "Магистраль" ],
    [ /MAGİSTRAL/g, "МАГИСТРАЛЬ" ],
    // материаль
    [ /material/g, "материаль" ],
    [ /Material/g, "Материаль" ],
    [ /MATERİAL/g, "МАТЕРИАЛЬ" ],
    // машиналь
    [ /maşinal/g, "машиналь" ],
    [ /Maşinal/g, "Машиналь" ],
    [ /MAŞİNAL/g, "МАШИНАЛЬ" ],
    // меаль
    [ /meal/g, "меаль" ],
    [ /Meal/g, "Меаль" ],
    [ /MEAL/g, "МЕАЛЬ" ],
    // медаль
    [ /medal/g, "медаль" ],
    [ /Medal/g, "Медаль" ],
    [ /MEDAL/g, "МЕДАЛЬ" ],
    // меридиональ
    [ /meridional/g, "меридиональ" ],
    [ /Meridional/g, "Меридиональ" ],
    [ /MERİDİONAL/g, "МЕРИДИОНАЛЬ" ],
    // мешъаль
    [ /meşal/g, "мешъаль" ],
    [ /Meşal/g, "Мешъаль" ],
    [ /MEŞAL/g, "МЕШЪАЛЬ" ],
    // минераль
    [ /mineral/g, "минераль" ],
    [ /Mineral/g, "Минераль" ],
    [ /MİNERAL/g, "МИНЕРАЛЬ" ],
    // минималь
    [ /minimal/g, "минималь" ],
    [ /Minimal/g, "Минималь" ],
    [ /MİNİMAL/g, "МИНИМАЛЬ" ],
    // мисаль
    [ /misal/g, "мисаль" ],
    [ /Misal/g, "Мисаль" ],
    [ /MİSAL/g, "МИСАЛЬ" ],
    // модаль
    [ /modal/g, "модаль" ],
    [ /Modal/g, "Модаль" ],
    [ /MODAL/g, "МОДАЛЬ" ],
    // музыкаль
    [ /muzıkal/g, "музыкаль" ],
    [ /Muzıkal/g, "Музыкаль" ],
    [ /MUZIKAL/g, "МУЗЫКАЛЬ" ],
    // номиналь
    [ /nominal/g, "номиналь" ],
    [ /Nominal/g, "Номиналь" ],
    [ /NOMİNAL/g, "НОМИНАЛЬ" ],
    // нормаль
    [ /normal/g, "нормаль" ],
    [ /Normal/g, "Нормаль" ],
    [ /NORMAL/g, "НОРМАЛЬ" ],
    // оптималь
    [ /optimal/g, "оптималь" ],
    [ /Optimal/g, "Оптималь" ],
    [ /OPTİMAL/g, "ОПТИМАЛЬ" ],
    // орбиталь
    [ /orbital/g, "орбиталь" ],
    [ /Orbital/g, "Орбиталь" ],
    [ /ORBİTAL/g, "ОРБИТАЛЬ" ],
    // оригиналь
    [ /original/g, "оригиналь" ],
    [ /Original/g, "Оригиналь" ],
    [ /ORİGİNAL/g, "ОРИГИНАЛЬ" ],
    // педаль
    [ /pedal/g, "педаль" ],
    [ /Pedal/g, "Педаль" ],
    [ /PEDAL/g, "ПЕДАЛЬ" ],
    // пропорциональ
    [ /proportsional/g, "пропорциональ" ],
    [ /Proportsional/g, "Пропорциональ" ],
    [ /PROPORTSİONAL/g, "ПРОПРОЦИОНАЛЬ" ],
    // профессиональ
    [ /professional/g, "профессиональ" ],
    [ /Professional/g, "Профессиональ" ],
    [ /PROFESSİONAL/g, "ПРОФЕССИОНАЛЬ" ],
    // радикаль
    [ /radikal/g, "радикаль" ],
    [ /Radikal/g, "Радикаль" ],
    [ /RADİKAL/g, "РАДИКАЛЬ" ],
    // рациональ
    [ /ratsional/g, "рациональ" ],
    [ /Ratsional/g, "Рациональ" ],
    [ /RATSİONAL/g, "РАЦИОНАЛЬ" ],
    // реаль
    [ /real/g, "реаль" ],
    [ /Real/g, "Реаль" ],
    [ /REAL/g, "РЕАЛЬ" ],
    // региональ
    [ /regional/g, "региональ" ],
    [ /Regional/g, "Региональ" ],
    [ /REGİONAL/g, "РЕГИОНАЛЬ" ],
    // суаль
    [ /sual/g, "суаль" ],
    [ /Sual/g, "Суаль" ],
    [ /SUAL/g, "СУАЛЬ" ],
    // шималь
    [ /şimal/g, "шималь" ],
    [ /Şimal/g, "Шималь" ],
    [ /ŞİMAL/g, "ШИМАЛЬ" ],
    // территориаль
    [ /territorial/g, "территориаль" ],
    [ /Territorial/g, "Территориаль" ],
    [ /TERRİTORİAL/g, "ТЕРРИТОРИАЛЬ" ],
    // тимсаль
    [ /timsal/g, "тимсаль" ],
    [ /Timsal/g, "Тимсаль" ],
    [ /TİMSAL/g, "ТИМСАЛЬ" ],
    // тоталь
    [ /total/g, "тоталь" ],
    [ /Total/g, "Тоталь" ],
    [ /TOTAL/g, "ТОТАЛЬ" ],
    // универсаль
    [ /universal/g, "универсаль" ],
    [ /Universal/g, "Универсаль" ],
    [ /UNİVERSAL/g, "УНИВЕРСАЛЬ" ],
    // уникаль
    [ /unikal/g, "уникаль" ],
    [ /Unikal/g, "Уникаль" ],
    [ /UNİKAL/g, "УНИКАЛЬ" ],
    // вертикаль
    [ /vertikal/g, "вертикаль" ],
    [ /Vertikal/g, "Вертикаль" ],
    [ /VERTİKAL/g, "ВЕРТИКАЛЬ" ],
    // виртуаль
    [ /virtual/g, "виртуаль" ],
    [ /Virtual/g, "Виртуаль" ],
    [ /VİRTUAL/g, "ВИРТУАЛЬ" ],
    // визуаль
    [ /vizual/g, "визуаль" ],
    [ /Vizual/g, "Визуаль" ],
    [ /VİZUAL/g, "ВИЗУАЛЬ" ],
    // вуаль
    [ /vual/g, "вуаль" ],
    [ /Vual/g, "Вуаль" ],
    [ /VUAL/g, "ВУАЛЬ" ],
    // зональ
    [ /zonal/g, "зональ" ],
    [ /Zonal/g, "Зональ" ],
    [ /ZONAL/g, "ЗОНАЛЬ" ],
    // зуаль
    [ /zual/g, "зуаль" ],
    [ /Zual/g, "Зуаль" ],
    [ /ZUAL/g, "ЗУАЛЬ" ],
    // слова с мягким знаком перед а, о, у, э
    // бильакис
    [ /bilakis/g, "бильакис" ],
    [ /Bilakis/g, "Бильакис" ],
    [ /BİLAKİS/g, "БИЛЬАКИС" ],
    // февкъульаде
    [ /fevqulade/g, "февкъульаде" ],
    [ /Fevqulade/g, "Февкъульаде" ],
    [ /FEVQULADE/g, "ФЕВКЪУЛЬАДЕ" ],
    [ /fevqulâde/g, "февкъульаде" ],
    [ /Fevqulâde/g, "Февкъульаде" ],
    [ /FEVQULÂDE/g, "ФЕВКЪУЛЬАДЕ" ],
    // маальэсеф
    [ /maalesef/g, "маальэсеф" ],
    [ /Maalesef/g, "Маальэсеф" ],
    [ /MAALESEF/g, "МААЛЬЭСЕФ" ],
    // мельэм
    [ /([\s"'\(\)\-.,:;!?>\]/])melem/g, "$1мельэм" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Melem/g, "$1Мельэм" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])MELEM/g, "$1МЕЛЬЭМ" ],
    // мельун
    [ /melun/g, "мельун" ],
    [ /Melun/g, "Мельун" ],
    [ /MELUN/g, "МЕЛЬУН" ],
    // вельасыл
    [ /velasıl/g, "вельасыл" ],
    [ /Velasıl/g, "Вельасыл" ],
    [ /VELASIL/g, "ВЕЛЬАСЫЛ" ],
    // ельаякъ
    [ /yelayaq/g, "ельаякъ" ],
    [ /Yelayaq/g, "Ельаякъ" ],
    [ /YELAYAQ/g, "ЕЛЬАЯКЪ" ],
    // другие слова с мягким знаком
    // альбатрос
    [ /albatros/g, "альбатрос" ],
    [ /Albatros/g, "Альбатрос" ],
    [ /ALBATROS/g, "АЛЬБАТРОС" ],
    // альбинос
    [ /albinos/g, "альбинос" ],
    [ /Albinos/g, "Альбинос" ],
    [ /ALBİNOS/g, "АЛЬБИНОС" ],
    // альбом
    [ /albom/g, "альбом" ],
    [ /Albom/g, "Альбом" ],
    [ /ALBOM/g, "АЛЬБОМ" ],
    // альбумин
    [ /albumin/g, "альбумин" ],
    [ /Albumin/g, "Альбумин" ],
    [ /ALBUMİN/g, "АЛЬБУМИН" ],
    // алфавит
    [ /alfavit/g, "алфавит" ],
    [ /Alfavit/g, "Алфавит" ],
    [ /ALFAVİT/g, "АЛФАВИТ" ],
    // альфа
    [ /alfa/g, "альфа" ],
    [ /Alfa/g, "Альфа" ],
    [ /ALFA/g, "АЛЬФА" ],
    // альманах
    [ /almanah/g, "альманах" ],
    [ /Almanah/g, "Альманах" ],
    [ /ALMANAH/g, "АЛЬМАНАХ" ],
    // альпинист
    [ /alpinist/g, "альпинист" ],
    [ /Alpinist/g, "Альпинист" ],
    [ /ALPİNİST/g, "АЛЬПИНИСТ" ],
    // альтерн
    [ /altern/g, "альтерн" ],
    [ /Altern/g, "Альтерн" ],
    [ /ALTERN/g, "АЛЬТЕРН" ],
    // альтру
    [ /altru/g, "альтру" ],
    [ /Altru/g, "Альтру" ],
    [ /ALTRU/g, "АЛЬТРУ" ],
    // альвеола
    [ /alveola/g, "альвеола" ],
    [ /Alveola/g, "Альвеола" ],
    [ /ALVEOLA/g, "АЛЬВЕОЛА" ],
    // ансамбль
    [ /ansambl/g, "ансамбль" ],
    [ /Ansambl/g, "Ансамбль" ],
    [ /ANSAMBL/g, "АНСАМБЛЬ" ],
    // ань
    [ /([\s"'\(\)\-.,:;!?>\]/])an([\s"'.,:;!?\)\-\[<])/g, "$1ань$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])An([\s"'.,:;!?\)\-\[<])/g, "$1Ань$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])AN([\s"'.,:;!?\)\-\[<])/g, "$1АНЬ$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ange([\s"'.,:;!?\)\-\[<])/g, "$1аньге$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ange([\s"'.,:;!?\)\-\[<])/g, "$1Аньге$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ANGE([\s"'.,:;!?\)\-\[<])/g, "$1АНЬГЕ$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ande([\s"'.,:;!?\)\-\[<])/g, "$1аньде$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ande([\s"'.,:;!?\)\-\[<])/g, "$1Аньде$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ANDE([\s"'.,:;!?\)\-\[<])/g, "$1АНЬДЕ$2" ],
    // аньане
    [ /anane/g, "аньане" ],
    [ /Anane/g, "Аньане" ],
    [ /ANANE/g, "АНЬАНЕ" ],
    // асфальт
    [ /asfalt/g, "асфальт" ],
    [ /Asfalt/g, "Асфальт" ],
    [ /ASFALT/g, "АСФАЛЬТ" ],
    // бальнео
    [ /balneo/g, "бальнео" ],
    [ /Balneo/g, "Бальнео" ],
    [ /BALNEO/g, "БАЛЬНЕО" ],
    // баарь
    [ /baar/g, "баарь" ],
    [ /Baar/g, "Баарь" ],
    [ /BAAR/g, "БААРЬ" ],
    // базальт
    [ /bazalt/g, "базальт" ],
    [ /Bazalt/g, "Базальт" ],
    [ /BAZALT/g, "БАЗАЛЬТ" ],
    // бинокль
    [ /binokl/g, "бинокль" ],
    [ /Binokl/g, "Бинокль" ],
    [ /BİNOKL/g, "БИНОКЛЬ" ],
    // большевик
    [ /bolşevik/g, "большевик" ],
    [ /Bolşevik/g, "Большевик" ],
    [ /BOLŞEVİK/g, "БОЛЬШЕВИК" ],
    // бульдозер
    [ /buldozer/g, "бульдозер" ],
    [ /Buldozer/g, "Бульдозер" ],
    [ /BULDOZER/g, "БУЛЬДОЗЕР" ],
    // бульон
    [ /bulyon/g, "бульон" ],
    [ /Bulyon/g, "Бульон" ],
    [ /BULYON/g, "БУЛЬОН" ],
    // бульвар
    [ /bulvar/g, "бульвар" ],
    [ /Bulvar/g, "Бульвар" ],
    [ /BULVAR/g, "БУЛЬВАР" ],
    // джурьат
    [ /curat/g, "джурьат" ],
    [ /Curat/g, "Джурьат" ],
    [ /CURAT/g, "ДЖУРЬАТ" ],
    [ /cürat/g, "джурьат" ],
    [ /Cürat/g, "Джурьат" ],
    [ /CÜRAT/g, "ДЖУРЬАТ" ],
    // девальв
    [ /devalv/g, "девальв" ],
    [ /Devalv/g, "Девальв" ],
    [ /DEVALV/g, "ДЕВАЛЬВ" ],
    // факульт
    [ /fakult/g, "факульт" ],
    [ /Fakult/g, "Факульт" ],
    [ /FAKULT/g, "ФАКУЛЬТ" ],
    // фальсиф
    [ /falsif/g, "фальсиф" ],
    [ /Falsif/g, "Фальсиф" ],
    [ /FALSİF/g, "ФАЛЬСИФ" ],
    // фольклор
    [ /folklor/g, "фольклор" ],
    [ /Folklor/g, "Фольклор" ],
    [ /FOLKLOR/g, "ФОЛЬКЛОР" ],
    // гальван
    [ /galvan/g, "гальван" ],
    [ /Galvan/g, "Гальван" ],
    [ /GALVAN/g, "ГАЛЬВАН" ],
    // геральд
    [ /gerald/g, "геральд" ],
    [ /Gerald/g, "Геральд" ],
    [ /GERALD/g, "ГЕРАЛЬД" ],
    // госпиталь
    [ /gospital/g, "госпиталь" ],
    [ /Gospital/g, "Госпиталь" ],
    [ /GOSPİTAL/g, "ГОСПИТАЛЬ" ],
    // женьшень
    [ /jenşen/g, "женьшень" ],
    [ /Jenşen/g, "Женьшень" ],
    [ /JENŞEN/g, "ЖЕНЬШЕНЬ" ],
    // инвентарь
    [ /inventar/g, "инвентарь" ],
    [ /İnventar/g, "Инвентарь" ],
    [ /İNVENTAR/g, "ИНВЕНТАРЬ" ],
    // кальк
    [ /kalk/g, "кальк" ],
    [ /Kalk/g, "Кальк" ],
    [ /KALK/g, "КАЛЬК" ],
    // кальмар
    [ /kalmar/g, "кальмар" ],
    [ /Kalmar/g, "Кальмар" ],
    [ /KALMAR/g, "КАЛЬМАР" ],
    // каньон
    [ /kanyon/g, "каньон" ],
    [ /Kanyon/g, "Каньон" ],
    [ /KANYON/g, "КАНЬОН" ],
    // коньки
    [ /konki/g, "коньки" ],
    [ /Konki/g, "Коньки" ],
    [ /KONKİ/g, "КОНЬКИ" ],
    // консульт
    [ /konsult/g, "консульт" ],
    [ /Konsult/g, "Консульт" ],
    [ /KONSULT/g, "КОНСУЛЬТ" ],
    // контроль
    [ /kontrol/g, "контроль" ],
    [ /Kontrol/g, "Контроль" ],
    [ /KONTROL/g, "КОНТРОЛЬ" ],
    // кульмин
    [ /kulmin/g, "кульмин" ],
    [ /Kulmin/g, "Кульмин" ],
    [ /KULMİN/g, "КУЛЬМИН" ],
    // культив
    [ /kultiv/g, "культив" ],
    [ /Kultiv/g, "Культив" ],
    [ /KULTİV/g, "КУЛЬТИВ" ],
    // культур
    [ /kultur/g, "культур" ],
    [ /Kultur/g, "Культур" ],
    [ /KULTUR/g, "КУЛЬТУР" ],
    // куфь
    [ /küf([^eü])/g, "куфь$1" ],
    [ /Küf([^eü])/g, "Куфь$1" ],
    [ /KÜF([^EÜ])/g, "КУФЬ$1" ],
    // лагерь
    [ /lager/g, "лагерь" ],
    [ /Lager/g, "Лагерь" ],
    [ /LAGER/g, "ЛАГЕРЬ" ],
    // макъбуль
    [ /maqbul/g, "макъбуль" ],
    [ /Maqbul/g, "Макъбуль" ],
    [ /MAQBUL/g, "МАКЪБУЛЬ" ],
    // макъуль
    [ /maqul/g, "макъуль" ],
    [ /Maqul/g, "Макъуль" ],
    [ /MAQUL/g, "МАКЪУЛЬ" ],
    // мальт
    [ /malt/g, "мальт" ],
    [ /Malt/g, "Мальт" ],
    [ /MALT/g, "МАЛЬТ" ],
    // мальземе
    [ /malzeme/g, "мальземе" ],
    [ /Malzeme/g, "Мальземе" ],
    [ /MALZEME/g, "МАЛЬЗЕМЕ" ],
    // меджуль
    [ /mecul/g, "меджуль" ],
    [ /Mecul/g, "Меджуль" ],
    [ /MECUL/g, "МЕДЖУЛЬ" ],
    // мешгъуль
    [ /meşğul/g, "мешгъуль" ],
    [ /Meşğul/g, "Мешгъуль" ],
    [ /MEŞĞUL/g, "МЕШГЪУЛЬ" ],
    // мульти
    [ /multi/g, "мульти" ],
    [ /Multi/g, "Мульти" ],
    [ /MULTİ/g, "МУЛЬТИ" ],
    // мусульман
    [ /musulman/g, "мусульман" ],
    [ /Musulman/g, "Мусульман" ],
    [ /MUSULMAN/g, "МУСУЛЬМАН" ],
    // нефть
    [ /neft/g, "нефть" ],
    [ /Neft/g, "Нефть" ],
    [ /NEFT/g, "НЕФТЬ" ],
    // нуль
    [ /nul([\s"'.,:;!?\)\-\[<dgn])/g, "нуль$1" ],
    [ /Nul([\s"'.,:;!?\)\-\[<dgn])/g, "Нуль$1" ],
    [ /NUL([\s"'.,:;!?\)\-\[<dgn])/g, "НУЛЬ$1" ],
    // пальто
    [ /palto/g, "пальто" ],
    [ /Palto/g, "Пальто" ],
    [ /PALTO/g, "ПАЛЬТО" ],
    // пальма
    [ /([\s"'\(\)\-.,:;!?>\]/])palma/g, "$1пальма" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Рalma/g, "$1Пальма" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])PALMA/g, "$1ПАЛЬМА" ],
    // пароль
    [ /parol/g, "пароль" ],
    [ /Рarol/g, "Пароль" ],
    [ /PAROL/g, "ПАРОЛЬ" ],
    // патруль
    [ /patrul/g, "патруль" ],
    [ /Рatrul/g, "Патруль" ],
    [ /PATRUL/g, "ПАТРУЛЬ" ],
    // пенальти
    [ /penalti/g, "пенальти" ],
    [ /Рenalti/g, "Пенальти" ],
    [ /PENALTİ/g, "ПЕНАЛЬТИ" ],
    // къальби
    [ /qalbi/g, "къальби" ],
    [ /Qalbi/g, "Къальби" ],
    [ /QALBİ/g, "КЪАЛЬБИ" ],
    // къальп
    [ /qalpke/g, "къальпке" ],
    [ /Qalpke/g, "Къальпке" ],
    [ /QALPKE/g, "КЪАЛЬПКЕ" ],
    [ /qalpler/g, "къальплер" ],
    [ /Qalpler/g, "Къальплер" ],
    [ /QALPLER/g, "КЪАЛЬПЛЕР" ],
    [ /qalpni/g, "къальпни" ],
    [ /Qalpni/g, "Къальпни" ],
    [ /QALPNİ/g, "КЪАЛЬПНИ" ],
    [ /qalpte/g, "къальпте" ],
    [ /Qalpte/g, "Къальпте" ],
    [ /QALPTE/g, "КЪАЛЬПТЕ" ],
    // къаарь
    [ /qaar/g, "къаарь" ],
    [ /Qaar/g, "Къаарь" ],
    [ /QAAR/g, "КЪААРЬ" ],
    // ресуль
    [ /resul/g, "ресуль" ],
    [ /Resul/g, "Ресуль" ],
    [ /RESUL/g, "РЕСУЛЬ" ],
    // рыцарь
    [ /rıtsar/g, "рыцарь" ],
    [ /Rıtsar/g, "Рыцарь" ],
    [ /RITSAR/g, "РЫЦАРЬ" ],
    // роль
    [ /([\s"'\(\)\-.,:;!?>\]/])rol([^ü])/g, "роль$1" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Rol([^ü])/g, "Роль$1" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ROL([^Ü])/g, "РОЛЬ$1" ],
    // рояль
    [ /royal/g, "рояль" ],
    [ /Royal/g, "Рояль" ],
    [ /ROYAL/g, "РОЯЛЬ" ],
    // саарь
    [ /saar/g, "саарь" ],
    [ /Saar/g, "Саарь" ],
    [ /SAAR/g, "СААРЬ" ],
    // спираль
    [ /spiral/g, "спираль" ],
    [ /Spiral/g, "Спираль" ],
    [ /SPİRAL/g, "СПИРАЛЬ" ],
    // сульх
    [ /sulh/g, "сульх" ],
    [ /Sulh/g, "Сульх" ],
    [ /SULH/g, "СУЛЬХ" ],
    // сумбуль
    [ /sumbul/g, "сумбуль" ],
    [ /Sumbul/g, "Сумбуль" ],
    [ /SUMBUL/g, "СУМБУЛЬ" ],
    // суньий
    [ /suniy/g, "суньий" ],
    [ /Suniy/g, "Суньий" ],
    [ /SUNİY/g, "СУНЬИЙ" ],
    // сурьат
    [ /([\s"'\(\)\-.,:;!?>\]/])surat/g, "$1сурьат" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Surat/g, "$1Сурьат" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])SURAT/g, "$1СУРЬАТ" ],
    // темаюль
    [ /temayul/g, "темаюль" ],
    [ /Temayul/g, "Темаюль" ],
    [ /TEMAYUL/g, "ТЕМАЮЛЬ" ],
    // усть
    [ /([\s"'\(\)\-.,:;!?>\]/])üst([^ü])/g, "$1усть$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Üst([^ü])/g, "$1Усть$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ÜST([^Ü])/g, "$1УСТЬ$2" ],
    // шальвар
    [ /şalvar/g, "шальвар" ],
    [ /Şalvar/g, "Шальвар" ],
    [ /ŞALVAR/g, "ШАЛЬВАР" ],
    // шампунь
    [ /şampun/g, "шампунь" ],
    [ /Şampun/g, "Шампунь" ],
    [ /ŞAMPUN/g, "ШАМПУНЬ" ],
    // ультимат
    [ /ultimat/g, "ультимат" ],
    [ /Ultimat/g, "Ультимат" ],
    [ /ULTİMAT/g, "УЛЬТИМАТ" ],
    // ультра
    [ /ultra/g, "ультра" ],
    [ /Ultra/g, "Ультра" ],
    [ /ULTRA/g, "УЛЬТРА" ],
    // вальс
    [ /vals/g, "вальс" ],
    [ /Vals/g, "Вальс" ],
    [ /VALS/g, "ВАЛЬС" ],
    // вальц
    [ /valts/g, "вальц" ],
    [ /Valts/g, "Вальц" ],
    [ /VALTS/g, "ВАЛЬЦ" ],
    // ведомость
    [ /vedomost/g, "ведомость" ],
    [ /Vedomost/g, "Ведомость" ],
    [ /VEDOMOST/g, "ВЕДОМОСТЬ" ],
    // зулькъарнейн
    [ /zulqarneyn/g, "зулькъарнейн" ],
    [ /Zulqarneyn/g, "Зулькъарнейн" ],
    [ /ZULQARNEYN/g, "ЗУЛЬКЪАРНЕЙН" ],
    // январь
    [ /yanvar/g, "январь" ],
    [ /Yanvar/g, "Январь" ],
    [ /YANVAR/g, "ЯНВАРЬ" ],
    // февраль
    [ /fevral/g, "февраль" ],
    [ /Fevral/g, "Февраль" ],
    [ /FEVRAL/g, "ФЕВРАЛЬ" ],
    // июнь
    [ /iyün/g, "июнь" ],
    [ /İyün/g, "Июнь" ],
    [ /İYÜN/g, "ИЮНЬ" ],
    // сентябрь
    [ /sentâbr/g, "сентябрь" ],
    [ /Sentâbr/g, "Сентябрь" ],
    [ /SENTÂBR/g, "СЕНТЯБРЬ" ],
    // октябрь
    [ /oktâbr/g, "октябрь" ],
    [ /Oktâbr/g, "Октябрь" ],
    [ /OKTÂBR/g, "ОКТЯБРЬ" ],
    // ноябрь
    [ /noyabr/g, "ноябрь" ],
    [ /Noyabr/g, "Ноябрь" ],
    [ /NOYABR/g, "НОЯБРЬ" ],
    // декабрь
    [ /dekabr/g, "декабрь" ],
    [ /Dekabr/g, "Декабрь" ],
    [ /DEKABR/g, "ДЕКАБРЬ" ],
    // слова с твёрдым знаком
    // бидъат
    [ /bidat/g, "бидъат" ],
    [ /Bidat/g, "Бидъат" ],
    [ /BİDAT/g, "БИДЪАТ" ],
    // бузъюрек
    [ /buzyürek/g, "бузъюрек" ],
    [ /Buzyürek/g, "Бузъюрек" ],
    [ /BUZYÜREK/g, "БУЗЪЮРЕК" ],
    // атешъюрек
    [ /ateşyürek/g, "атешъюрек" ],
    [ /Ateşyürek/g, "Атешъюрек" ],
    [ /ATEŞYÜREK/g, "АТЕШЪЮРЕК" ],
    // алъянакъ
    [ /alyanaq/g, "алъянакъ" ],
    [ /Alyanaq/g, "Алъянакъ" ],
    [ /ALYANAQ/g, "АЛЪЯНАКЪ" ],
    // демиръёл
    [ /demiryol/g, "демиръёл" ],
    [ /Demiryol/g, "Демиръёл" ],
    [ /DEMİRYOL/g, "ДЕМИРЪЁЛ" ],
    // деръал
    [ /([\s"'\(\)\-.,:;!?>\]/])deral/g, "$1деръал" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Deral/g, "$1Деръал" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])DERAL/g, "$1ДЕРЪАЛ" ],
    // инъекц
    [ /inyekts/g, "инъекц" ],
    [ /İnyekts/g, "Инъекц" ],
    [ /İNYEKTS/g, "ИНЪЕКЦ" ],
    // конъюктура
    [ /konyuktur/g, "конъюктур" ],
    [ /Konyuktur/g, "Конъюктур" ],
    [ /KONYUKTUR/g, "КОНЪЮКТУР" ],
    // мефъум
    [ /mefum/g, "мефъум" ],
    [ /Mefum/g, "Мефъум" ],
    [ /MEFUM/g, "МЕФЪУМ" ],
    // мешъум
    [ /meşum/g, "мешъум" ],
    [ /Meşum/g, "Мешъум" ],
    [ /MEŞUM/g, "МЕШЪУМ" ],
    // объект
    [ /obyekt/g, "объект" ],
    [ /Obyekt/g, "Объект" ],
    [ /OBYEKT/g, "ОБЪЕКТ" ],
    // разъезд
    [ /razyezd/g, "разъезд" ],
    [ /Razyezd/g, "Разъезд" ],
    [ /RAZYEZD/g, "РАЗЪЕЗД" ],
    // субъект
    [ /subyekt/g, "субъект" ],
    [ /Subyekt/g, "Субъект" ],
    [ /SUBYEKT/g, "СУБЪЕКТ" ],
    // хавъяр
    [ /havyar/g, "хавъяр" ],
    [ /Havyar/g, "Хавъяр" ],
    [ /HAVYAR/g, "ХАВЪЯР" ],
    // ямъям
    [ /yamyam/g, "ямъям" ],
    [ /Yamyam/g, "Ямъям" ],
    [ /YAMYAM/g, "ЯМЪЯМ" ],
    // слова с буквой щ
    // ящик
    [ /yaşçik/g, "ящик" ],
    [ /Yaşçik/g, "Ящик" ],
    [ /YAŞÇİK/g, "ЯЩИК" ],
    // мещан
    [ /meşçan/g, "мещан" ],
    [ /Meşçan/g, "Мещан" ],
    [ /MEŞÇAN/g, "МЕЩАН" ],
    // слова с буквой ц
    // акциз
    [ /aktsiz/g, "акциз" ],
    [ /Aktsiz/g, "Акциз" ],
    [ /AKTSİZ/g, "АКЦИЗ" ],
    // ацет
    [ /atset/g, "ацет" ],
    [ /Atset/g, "Ацет" ],
    [ /ATSET/g, "АЦЕТ" ],
    // блиц
    [ /blits/g, "блиц" ],
    [ /Blits/g, "Блиц" ],
    [ /BLİTS/g, "БЛИЦ" ],
    // бруцеллёз
    [ /brutsellöz/g, "бруцеллёз" ],
    [ /Brutsellöz/g, "Бруцеллёз" ],
    [ /BRUTSELLÖZ/g, "БРУЦЕЛЛЁЗ" ],
    // доцент
    [ /dotsent/g, "доцент" ],
    [ /Dotsent/g, "Доцент" ],
    [ /DOTSENT/g, "ДОЦЕНТ" ],
    // фармацевт
    [ /farmatsevt/g, "фармацевт" ],
    [ /Farmatsevt/g, "Фармацевт" ],
    [ /FARMATSEVT/g, "ФАРМАЦЕВТ" ],
    // глицер
    [ /glitser/g, "глицер" ],
    [ /Glitser/g, "Глицер" ],
    [ /GLİTSER/g, "ГЛИЦЕР" ],
    // лицей
    [ /litsey/g, "лицей" ],
    [ /Litsey/g, "Лицей" ],
    [ /LİTSEY/g, "ЛИЦЕЙ" ],
    // люцерна
    [ /lütserna/g, "люцерна" ],
    [ /Lütserna/g, "Люцерна" ],
    [ /LÜTSERNA/g, "ЛЮЦЕРНА" ],
    // меццо
    [ /metstso/g, "меццо" ],
    [ /Metstso/g, "Меццо" ],
    [ /METSTSO/g, "МЕЦЦО" ],
    // мефкуре
    [ /mefküre/g, "мефкуре" ],
    [ /Mefküre/g, "Мефкуре" ],
    [ /MEFKÜRE/g, "МЕФКУРЕ" ],
    // нацизм
    [ /natsi/g, "наци" ],
    [ /Natsi/g, "Наци" ],
    [ /NATSİ/g, "НАЦИ" ],
    // офицер
    [ /ofitser/g, "офицер" ],
    [ /Ofitser/g, "Офицер" ],
    [ /OFİTSER/g, "ОФИЦЕР" ],
    // проце
    [ /protse/g, "проце" ],
    [ /Protse/g, "Проце" ],
    [ /PROTSE/g, "ПРОЦЕ" ],
    // реценз
    [ /retsenz/g, "реценз" ],
    [ /Retsenz/g, "Реценз" ],
    [ /RETSENZ/g, "РЕЦЕНЗ" ],
    // рецеп
    [ /retsep/g, "рецеп" ],
    [ /Retsep/g, "Рецеп" ],
    [ /RETSEP/g, "РЕЦЕП" ],
    // теплица
    [ /teplitsa/g, "теплица" ],
    [ /Teplitsa/g, "Теплица" ],
    [ /TEPLİTSA/g, "ТЕПЛИЦА" ],
    // вице
    [ /vitse/g, "вице" ],
    [ /Vitse/g, "Вице" ],
    [ /VİTSE/g, "ВИЦЕ" ],
    // цепс
    [ /tseps/g, "цепс" ],
    [ /TSEPS/g, "ЦЕПС" ],
    // швейцар
    [ /şveytsar/g, "швейцар" ],
    [ /Şveytsar/g, "Швейцар" ],
    [ /ŞVEYTSAR/g, "ШВЕЙЦАР" ],
    // слова без буквы ц (повелит. наклонение на -тсин)
    // агъартсын
    [ /ağarts/g, "агъартс" ],
    [ /Ağarts/g, "Агъартс" ],
    [ /AĞARTS/g, "АГЪАРТС" ],
    // агъыртсын
    [ /ağırts/g, "агъыртс" ],
    [ /Ağırts/g, "Агъыртс" ],
    [ /AĞIRTS/g, "АГЪЫРТС" ],
    // бильдиртсин
    [ /bildirts/g, "бильдиртс" ],
    [ /Bildirts/g, "Бильдиртс" ],
    [ /BİLDİRTS/g, "БИЛЬДИРТС" ],
    // битсин
    [ /bitsin/g, "битсин" ],
    [ /Bitsin/g, "Битсин" ],
    [ /BİTSİN/g, "БИТСИН" ],
    // буюльтсин
    [ /büyülts/g, "буюльтс" ],
    [ /Büyülts/g, "Буюльтс" ],
    [ /BÜYÜLTS/g, "БУЮЛЬТС" ],
    // буютсин
    [ /büyüts/g, "буютс" ],
    [ /Büyüts/g, "Буютс" ],
    [ /BÜYÜTS/g, "БУЮТС" ],
    // гебертс
    [ /geberts/g, "гебертс" ],
    [ /Geberts/g, "Гебертс" ],
    [ /GEBERTS/g, "ГЕБЕРТС" ],
    // делиртсин
    [ /delirts/g, "делиртс" ],
    [ /Delirts/g, "Делиртс" ],
    [ /DELİRTS/g, "ДЕЛИРТС" ],
    // эгрильтсин
    [ /egrilts/g, "эгрильтс" ],
    [ /Egrilts/g, "Эгрильтс" ],
    [ /EGRİLTS/g, "ЭГРИЛЬТС" ],
    // эксильтсин
    [ /eksilts/g, "эксильтс" ],
    [ /Eksilts/g, "Эксильтс" ],
    [ /EKSİLTS/g, "ЭКСИЛЬТС" ],
    // эшитсин
    [ /eşits/g, "эшитс" ],
    [ /Eşits/g, "Эшитс" ],
    [ /EŞİTS/g, "ЭШИТС" ],
    // иритсин
    [ /irits/g, "иритс" ],
    [ /İrits/g, "Иритс" ],
    [ /İRİTS/g, "ИРИТС" ],
    // иситсин
    [ /isits/g, "иситс" ],
    [ /İsits/g, "Иситс" ],
    [ /İSİTS/g, "ИСИТС" ],
    // ичиртсин
    [ /içirts/g, "ичиртс" ],
    [ /İçirts/g, "Ичиртс" ],
    [ /İÇİRTS/g, "ИЧИРТС" ],
    // кертсин
    [ /kertsin/g, "кертсин" ],
    [ /Kertsin/g, "Кертсин" ],
    [ /KERTSİN/g, "КЕРТСИН" ],
    // кенишлетсин
    [ /kenişlets/g, "кенишлетс" ],
    [ /Kenişlets/g, "Кенишлетс" ],
    [ /KENİŞLETS/g, "КЕНИШЛЕТС" ],
    // кийсетсин
    [ /kiysets/g, "кийсетс" ],
    [ /Kiysets/g, "Кийсетс" ],
    [ /KİYSETS/g, "КИЙСЕТС" ],
    // копюртсин
    [ /köpürts/g, "копюртс" ],
    [ /Köpürts/g, "Копюртс" ],
    [ /KÖPÜRTS/g, "КОПЮРТС" ],
    // косьтертсин
    [ /kösterts/g, "косьтертс" ],
    [ /Kösterts/g, "Косьтертс" ],
    [ /KÖSTERTS/g, "КОСЬТЕРТС" ],
    // кучертсин
    [ /küçerts/g, "кучертс" ],
    [ /Küçerts/g, "Кучертс" ],
    [ /KÜÇERTS/g, "КУЧЕРТС" ],
    // кучюльтсин
    [ /küçülts/g, "кучюльтс" ],
    [ /Küçülts/g, "Кучюльтс" ],
    [ /KÜÇÜLTS/g, "КУЧЮЛЬТС" ],
    // пертсин
    [ /pertsin/g, "пертсин" ],
    [ /Pertsin/g, "Пертсин" ],
    [ /PERTSİN/g, "ПЕРТСИН" ],
    // къайтсын
    [ /qayts/g, "къайтс" ],
    [ /Qayts/g, "Къайтс" ],
    [ /QAYTS/g, "КЪАЙТС" ],
    // отьсин
    [ /öts/g, "отьс" ],
    [ /Öts/g, "Отьс" ],
    [ /ÖTS/g, "ОТЬС" ],
    // орьтсин
    [ /örts/g, "орьтс" ],
    [ /Örts/g, "Орьтс" ],
    [ /ÖRTS/g, "ОРЬТС" ],
    // тартсын
    [ /tarts/g, "тартс" ],
    [ /Tarts/g, "Тартс" ],
    [ /TARTS/g, "ТАРТС" ],
    // тутсун
    [ /tutsun/g, "тутсун" ],
    [ /Tutsun/g, "Тутсун" ],
    [ /TUTSUN/g, "ТУТСУН" ],
    // тюнъюльтсин
    [ /tüñülts/g, "тюнъюльтс" ],
    [ /Tüñülts/g, "Тюнъюльтс" ],
    [ /TÜÑÜLTS/g, "ТЮНЪЮЛЬТС" ],
    // тюртсин
    [ /türts/g, "тюртс" ],
    [ /Türts/g, "Тюртс" ],
    [ /TÜRTS/g, "ТЮРТС" ],
    // янъартсын
    [ /yañarts/g, "янъартс" ],
    [ /Yañarts/g, "Янъартс" ],
    [ /YAÑARTS/g, "ЯНЪАРТС" ],
    // ебертсин
    [ /yeberts/g, "ебертс" ],
    [ /Yeberts/g, "Ебертс" ],
    [ /YEBERTS/g, "ЕБЕРТС" ],
    // етсин
    [ /yetsin/g, "етсин" ],
    [ /Yetsin/g, "Етсин" ],
    [ /YETSİN/g, "ЕТСИН" ],
    // ешертсин
    [ /yeşerts/g, "ешертс" ],
    [ /Yeşerts/g, "Ешертс" ],
    [ /YEŞERTS/g, "ЕШЕРТС" ],
    // йиритсин
    [ /yirits/g, "йиритс" ],
    [ /Yirits/g, "Йиритс" ],
    [ /YİRİTS/g, "ЙИРИТС" ],
    // этсин
    [ /([\s"'\(\)\-.,:;!?>\]/])etsin/g, "$1этсин" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Etsin/g, "$1Этсин" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ETSİN/g, "$1ЭТСИН" ],
    // -етсин
    [ /etsin/g, "етсин" ],
    [ /ETSİN/g, "ЕТСИН" ],
    // къутсуз
    [ /qutsuz/g, "къутсуз" ],
    [ /Qutsuz/g, "Къутсуз" ],
    [ /QUTSUZ/g, "КЪУТСУЗ" ],
    // разные исключения
    // алейкум
    [ /aleyküm/g, "алейкум" ],
    [ /Aleyküm/g, "Алейкум" ],
    [ /ALEYKÜM/g, "АЛЕЙКУМ" ],
    // бейуде
    [ /beyüde/g, "бейуде" ],
    [ /Beyüde/g, "Бейуде" ],
    [ /BEYÜDE/g, "БЕЙУДЕ" ],
    [ /beyude/g, "бейуде" ],
    [ /Beyude/g, "Бейуде" ],
    [ /BEYUDE/g, "БЕЙУДЕ" ],
    // бугунь
    [ /bugün/g, "бугунь" ],
    [ /Bugün/g, "Бугунь" ],
    [ /BUGÜN/g, "БУГУНЬ" ],
    // бюджет
    [ /bücet/g, "бюджет" ],
    [ /Bücet/g, "Бюджет" ],
    [ /BÜCET/g, "БЮДЖЕТ" ],
    // бульбуль
    [ /bülbül/g, "бульбуль" ],
    [ /Bülbül/g, "Бульбуль" ],
    [ /BÜLBÜL/g, "БУЛЬБУЛЬ" ],
    // бюллет
    [ /büllet/g, "бюллет" ],
    [ /Büllet/g, "Бюллет" ],
    [ /BÜLLET/g, "БЮЛЛЕТ" ],
    // бюро
    [ /büro/g, "бюро" ],
    [ /Büro/g, "Бюро" ],
    [ /BÜRO/g, "БЮРО" ],
    // бус-бутюн
    [ /büs-bütün/g, "бус-бутюн" ],
    [ /Büs-bütün/g, "Бус-бутюн" ],
    [ /BÜS-BÜTÜN/g, "БУС-БУТЮН" ],
    // бюст
    [ /büst/g, "бюст" ],
    [ /Büst/g, "Бюст" ],
    [ /BÜST/g, "БЮСТ" ],
    // вакъиалар
    [ /vaqиаль/g, "вакъиал" ],
    [ /Vaqиаль/g, "Вакъиал" ],
    [ /VAQИАЛЬ/g, "ВАКЪИАЛ" ],
    // гонъюль
    [ /göñül/g, "гонъюль" ],
    [ /GÖÑÜL/g, "ГОНЪЮЛЬ" ],
    // гургуль
    [ /gürgül/g, "гургуль" ],
    [ /Gürgül/g, "Гургуль" ],
    [ /GÜRGÜL/g, "ГУРГУЛЬ" ],
    // джонк
    [ /cönk/g, "джонк" ],
    [ /Cönk/g, "Джонк" ],
    [ /CÖNK/g, "ДЖОНК" ],
    // джуньджу
    [ /cüncü/g, "джуньджу" ],
    [ /Cüncü/g, "Джуньджу" ],
    [ /CÜNCÜ/g, "ДЖУНЬДЖУ" ],
    // диалог
    [ /dиальog/g, "диалог" ],
    [ /Dиальog/g, "Диалог" ],
    [ /DИАЛЬOG/g, "ДИАЛОГ" ],
    // зумбуль
    [ /zümbül/g, "зумбуль" ],
    [ /Zümbül/g, "Зумбуль" ],
    [ /ZÜMBÜL/g, "ЗУМБУЛЬ" ],
    // йод
    [ /([\s"'\(\)\-.,:;!?>\]/])yod/g, "$1йод" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Yod/g, "$1Йод" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])YOD/g, "$1ЙОД" ],
    // кёр
    [ /([\s"'\(\)\-.,:;!?>\]/])kör([\s"'.,:;!?\)\-\[<])/g, "$1кёр$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Kör([\s"'.,:;!?\)\-\[<])/g, "$1Кёр$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])KÖR([\s"'.,:;!?\)\-\[<])/g, "$1КЁР$2" ],
    // койот
    [ /koyot/g, "койот" ],
    [ /Koyot/g, "Койот" ],
    [ /KOYOT/g, "КОЙОТ" ],
    // кёрджа
    [ /körca/g, "кёрджа" ],
    [ /Körca/g, "Кёрджа" ],
    [ /KÖRCA/g, "КЁРДЖА" ],
    // кирил
    [ /kiril/g, "кирил" ],
    [ /Kiril/g, "Кирил" ],
    [ /KİRİL/g, "КИРИЛ" ],
    // конвейер
    [ /kоnveyer/g, "конвейер" ],
    [ /Kоnveyer/g, "Конвейер" ],
    [ /KONVEYER/g, "КОНВЕЙЕР" ],
    // коше
    [ /köşe/g, "коше" ],
    [ /Köşe/g, "Коше" ],
    [ /KÖŞE/g, "КОШЕ" ],
    // кой
    [ /köy/g, "коy" ],
    [ /Köy/g, "Коy" ],
    [ /KÖY/g, "КОY" ],
    // козь
    [ /köz([^üe])/g, "козь$1" ],
    [ /Köz([^üe])/g, "Козь$1" ],
    [ /KÖZ([^Üe])/g, "КОЗЬ$1" ],
    // кушку
    [ /küşkü/g, "кушку" ],
    [ /Küşkü/g, "Кушку" ],
    [ /KÜŞKÜ/g, "КУШКУ" ],
    // кулеръюзь
    [ /küleryüz/g, "кулеръюзь" ],
    [ /Küleryüz/g, "Кулеръюзь" ],
    [ /KÜLERYÜZ/g, "КУЛЕРЪЮЗЬ" ],
    // маалле
    [ /маальle/g, "маалле" ],
    [ /Маальle/g, "Маалле" ],
    [ /МААЛЬLE/g, "МААЛЛЕ" ],
    // майор
    [ /mayor/g, "майор" ],
    [ /Mayor/g, "Майор" ],
    [ /MAYOR/g, "МАЙОР" ],
    // маниалар
    [ /manиаль/g, "маниал" ],
    [ /Manиаль/g, "Маниал" ],
    [ /MANИАЛЬ/g, "МАНИАЛ" ],
    // месуль
    [ /mesül/g, "месуль" ],
    [ /Mesül/g, "Месуль" ],
    [ /MESÜL/g, "МЕСУЛЬ" ],
    [ /mesul/g, "месуль" ],
    [ /Mesul/g, "Месуль" ],
    [ /MESUL/g, "МЕСУЛЬ" ],
    // мевджут
    [ /mevcü/g, "мевджу" ],
    [ /Mevcü/g, "Мевджу" ],
    [ /MEVCÜ/g, "МЕВДЖУ" ],
    // муурь
    [ /müür/g, "муурь" ],
    [ /Müür/g, "Муурь" ],
    [ /MÜÜR/g, "МУУРЬ" ],
    // мэр
    [ /([\s"'\(\)\-.,:;!?>\]/])mer([i\s"'.,:;!?\)\-\[<])/g, "$1мэр$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Mer([i\s"'.,:;!?\)\-\[<])/g, "$1Мэр$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])MER([İ\s"'.,:;!?\)\-\[<])/g, "$1МЭР$2" ],
    // меридиан
    [ /мэридиан/g, "меридиан" ],
    [ /Мэридиан/g, "Меридиан" ],
    [ /МЭРИДИАН/g, "МЕРИДИАН" ],
    // нормалар
    [ /нормальa/g, "нормала" ],
    [ /Нормальa/g, "Нормала" ],
    [ /НОРМАЛЬA/g, "НОРМАЛА" ],
    // нумюне
    [ /nümüne/g, "нумюне" ],
    [ /Nümüne/g, "Нумюне" ],
    [ /NÜMÜNE/g, "НУМЮНЕ" ],
    // ольчер
    [ /ölçer/g, "ольчер" ],
    [ /ÖLÇER/g, "ОЛЬЧЕР" ],
    // проект
    [ /proekt/g, "проект" ],
    [ /Proekt/g, "Проект" ],
    [ /PROEKT/g, "ПРОЕКТ" ],
    // район
    [ /rayon/g, "район" ],
    [ /Rayon/g, "Район" ],
    [ /RAYON/g, "РАЙОН" ],
    // сойады
    [ /soyadı/g, "сойады" ],
    [ /Soyadı/g, "Сойады" ],
    [ /SOYADI/g, "СОЙАДЫ" ],
    // спортсмен
    [ /sportsmen/g, "спортсмен" ],
    [ /Sportsmen/g, "Спортсмен" ],
    [ /SPORTSMEN/g, "СПОРТСМЕН" ],
    // сурет
    [ /süret/g, "сурет" ],
    [ /Süret/g, "Сурет" ],
    [ /SÜRET/g, "СУРЕТ" ],
    // сурет
    [ /hanımefendi/g, "ханымэфенди" ],
    [ /Hanımefendi/g, "Ханымэфенди" ],
    [ /HANIMEFENDİ/g, "ХАНЫМЭФЕНДИ" ],
    // услюп
    [ /([\s"'\(\)\-.,:;!?>\]/])üslü/g, "$1услю" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Üslü/g, "$1Услю" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ÜSLÜ/g, "$1УСЛЮ" ],
    // эгуль
    [ /([\s"'\(\)\-.,:;!?>\]/])egül/g, "$1эгуль" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Egül/g, "$1Эгуль" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])EGÜL/g, "$1ЭГУЛЬ" ],
    // юзбашы
    [ /([\s"'\(\)\-.,:;!?>\]/])yüzbaşı/g, "$1юзбашы" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Yüzbaşı/g, "$1Юзбашы" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])YÜZBAŞI/g, "$1ЮЗБАШЫ" ],
    // юзйыллыкъ
    [ /([\s"'\(\)\-.,:;!?>\]/])yüzyıl/g, "$1юзйыл" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Yüzyıl/g, "$1Юзйыл" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])YÜZYIL/g, "$1ЮЗЙЫЛ" ],
    // 3-юнджи, 4-юнджи
    [ /([34])-ünci/g, "$1-юнджи" ],
    [ /([34])-ÜNCİ/g, "$1-юнджи" ],
    // имена собственные
    // Альберт
    [ /Albert/g, "Альберт" ],
    [ /ALBERT/g, "АЛЬБЕРТ" ],
    // Ботсвана
    [ /Botsvana/g, "Ботсвана" ],
    [ /BOTSVANA/g, "БОТСВАНА" ],
    // Гайана
    [ /Gayana/g, "Гайана" ],
    [ /GAYANA/g, "ГАЙАНА" ],
    // Гриц
    [ /Grits/g, "Гриц" ],
    [ /GRİTS/g, "ГРИЦ" ],
    // гурджи
    [ /gürci/g, "гурджи" ],
    [ /Gürci/g, "Гурджи" ],
    [ /GÜRCİ/g, "ГУРДЖИ" ],
    // Эмирусеин
    [ /Emirüsein/g, "Эмирусеин" ],
    [ /EMİRÜSEİN/g, "ЭМИРУСЕИН" ],
    // -флотский
    [ /flotsk/g, "флотск" ],
    [ /Flotsk/g, "Флотск" ],
    [ /FLOTSK/g, "ФЛОТСК" ],
    // Игорь
    [ /İgor/g, "Игорь" ],
    [ /İGOR/g, "ИГОРЬ" ],
    // Исмаил
    [ /ismail/g, "исмаил" ],
    [ /İsmail/g, "Исмаил" ],
    [ /İSMAİL/g, "ИСМАИЛ" ],
    // (Сент-)Киттс
    [ /([\s"'\(\)\-.,:;!?>\]/])Kitts/g, "$1Киттс" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])KİTTS/g, "$1КИТТС" ],
    // Корбекуль
    [ /Körbekülü/g, "Корбекулю" ],
    [ /KÖRBEKÜLÜ/g, "КОРБЕКУЛЮ" ],
    [ /Körbekül/g, "Корбекуль" ],
    [ /KÖRBEKÜL/g, "КОРБЕКУЛЬ" ],
    // Куницин
    [ /Kunitsın/g, "Куницын" ],
    [ /KUNİTSIN/g, "КУНИЦЫН" ],
    // Львив
    [ /([\s"'\(\)\-.,:;!?>\]/])Lviv/g, "$1Львив" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])LVİV/g, "$1ЛЬВИВ" ],
    // Львов
    [ /([\s"'\(\)\-.,:;!?>\]/])Lvov/g, "$1Львов" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])LVOV/g, "$1ЛЬВОВ" ],
    // Къуртсейит
    [ /Qurtseyit/g, "Къуртсейит" ],
    [ /QURTSEYİT/g, "КЪУРТСЕЙИТ" ],
    // Къуртсеит
    [ /Qurtseit/g, "Къуртсеит" ],
    [ /QURTSEİT/g, "КЪУРТСЕИТ" ],
    // Къуртумер
    [ /Qurtümer/g, "Къуртумер" ],
    [ /QURTÜMER/g, "КЪУРТУМЕР" ],
    // Мариуполь
    [ /Mariupol/g, "Мариуполь" ],
    [ /MARİUPOL/g, "МАРИУПОЛЬ" ],
    // Марьино
    [ /Maryino/g, "Марьино" ],
    [ /MARYİNO/g, "МАРЬИНО" ],
    // Мустеджип
    [ /Müsteci/g, "Мустеджи" ],
    [ /MÜSTECİ/g, "МУСТЕДЖИ" ],
    // Павел
    [ /([\s"'\(\)\-.,:;!?>\]/])Pavel/g, "$1Павел" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])PAVEL/g, "$1ПАВЕЛ" ],
    // Сеитумер
    [ /Seitümer/g, "Сеитумер" ],
    [ /SEİTÜMER/g, "СЕИТУМЕР" ],
    // Сеитусеин
    [ /Seitüsein/g, "Сеитусеин" ],
    [ /SEİTÜSEİN/g, "СЕИТУСЕИН" ],
    // Сейитумер
    [ /Seyitümer/g, "Сейитумер" ],
    [ /SEYİTÜMER/g, "СЕЙИТУМЕР" ],
    // Сейитусеин
    [ /Seyitüsein/g, "Сейитусеин" ],
    [ /SEYİTÜSEİN/g, "СЕЙИТУСЕИН" ],
    // Сейитусейин
    [ /Seyitüseyin/g, "Сейитусейин" ],
    [ /SEYİTÜSEYİN/g, "СЕЙИТУСЕЙИН" ],
    // Смаил
    [ /smail/g, "смаил" ],
    [ /Smail/g, "Смаил" ],
    [ /SMAİL/g, "СМАИЛ" ],
    // Советский
    [ /sovetsk/g, "советск" ],
    [ /Sovetsk/g, "Советск" ],
    [ /SOVETSK/g, "СОВЕТСК" ],
    // Шемьи-заде
    [ /şemi-zade/g, "шемьи-заде" ],
    [ /Şemi-zade/g, "Шемьи-заде" ],
    [ /ŞEMİ-ZADE/g, "ШЕМЬИ-ЗАДЕ" ],
    // йохан
    [ /Yohan/g, "Йохан" ],
    [ /YOHAN/g, "ЙОХАН" ],
    // йорк
    [ /York/g, "Йорк" ],
    [ /YORK/g, "ЙОРК" ],
    // ющенко
    [ /yuşçenko/g, "ющенко" ],
    [ /Yuşçenko/g, "Ющенко" ],
    [ /YUŞÇENKO/g, "ЮЩЕНКО" ],
    // зайц-
    [ /zayts/g, "зайц" ],
    [ /Zayts/g, "Зайц" ],
    [ /ZAYTS/g, "ЗАЙЦ" ],
    // -ополь
    [ /([^\s])opol/g, "$1ополь" ],
    [ /([^\s])OPOL/g, "$1ОПОЛЬ" ],
    // -льное
    [ /([^\s])lnoye/g, "$1льное" ],
    [ /([^\s])LNOYE/g, "$1ЛЬНОЕ" ],
    // -льный
    [ /([^\s])lnıy/g, "$1льный" ],
    [ /([^\s])LNIY/g, "$1ЛЬНЫЙ" ],
    // -льняя
    [ /([^\s])lnâya/g, "$1льняя" ],
    [ /([^\s])LNÂYA/g, "$1ЛЬНЯЯ" ],
    // -льская
    [ /([^\s])lskaya/g, "$1льская" ],
    [ /([^\s])LSKAYA/g, "$1ЛЬСКАЯ" ],
    // -льский
    [ /([^\s])lskiy/g, "$1льский" ],
    [ /([^\s])LSKİY/g, "$1ЛЬСКИЙ" ],
    // -льское
    [ /([^\s])lskoye/g, "$1льское" ],
    [ /([^\s])LSKOYE/g, "$1ЛЬСКОЕ" ],
    // аббревиатуры
    // КъМДж
    [ /QMC/g, "КъМДж" ],
    // АКъШ
    [ /AQŞ([^AEI])/g, "АКъШ$1" ],
    // КъАЭ
    [ /QAE/g, "КъАЭ" ],
    // ГъСМК
    [ /ĞSMK/g, "ГъСМК" ],
    // ШСДжБ
    [ /ŞSCB/g, "ШСДжБ" ],
    // КъМШСДж
    [ /QMŞSC/g, "КъМШСДж" ],
    // КъДМПУ
    [ /QDMPU/g, "КъДМПУ" ],
    // КъМПУ
    [ /QMPU/g, "КъМПУ" ],
    // ЮШ
    [ /([\s"'\(\)\-.,:;!?>\]/])YŞ/g, "$1ЮШ" ],
    // ЮР
    [ /([\s"'\(\)\-.,:;!?>\]/])YR/g, "$1ЮР" ],
    // КъУТ
    [ /QÜT/g, "КъУТ" ],
    // 0.A. некоторые случаи употребления буквы ц
    // ц-
    [ /([\s"'\(\)\-.,:;!?>\]/])ts/g, "$1ц" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])T[sS]/g, "$1Ц" ],
    // -ц
    [ /ts([\s"'.,:;!?\)\-\[<])/g, "ц$1" ],
    [ /T[sS]([\s"'.,:;!?\)\-\[<])/g, "Ц$1" ],
    // -ци-
    [ /tsi([^zñ])/g, "ци$1" ],
    [ /T[sS][iİ]([^zZñÑ])/g, "ЦИ$1" ],
    // -цо-, -цу-
    [ /ts([ou])/g, "ц$1" ],
    [ /T[sS]([oOuU])/g, "Ц$1" ],
    // - ц согл. -
    [ /ts([bcçdfghjklmnprsştvyzBCÇDFGHJKLMNPRSŞTVYZ])/g, "ц$1" ],
    [ /T[sS]([bcçdfghjklmnprsştvyzBCÇDFGHJKLMNPRSŞTVYZ])/g, "Ц$1" ],
    // - согл. ц -
    [ /([bcçdfghjklmnprsştvzBCÇDFGHJKLMNPRSŞTVZ])ts([^iİ])([^zZñÑ])/g, "$1ц$2$3" ],
    [ /([bcçdfghjklmnprsştvzBCÇDFGHJKLMNPRSŞTVZ])T[sS]([^iİ])([^zZñÑ])/g, "$1Ц$2$3" ],
    // циал
    [ /tsиал/g, "циал" ],
    [ /TSИАЛ/g, "ЦИАЛ" ],
    [ /tsizm/g, "цизм" ],
    [ /TSİZM/g, "ЦИЗМ" ],
    [ /цın/g, "тсын" ],
    [ /ЦIN/g, "ТСЫН" ],
    [ /цız/g, "тсыз" ],
    [ /ЦIZ/g, "ТСЫЗ" ],
    // 0.B. некоторые случаи употребления буквы щ
    // щ-
    [ /([\s"'\(\)\-.,:;!?>\]/])şç/g, "$1щ" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ş[çÇ]/g, "$1Щ" ],
    // -щ
    [ /şç([\s"'.,:;!?\)\-\[<])/g, "щ$1" ],
    [ /Ş[çÇ]([\s"'.,:;!?\)\-\[<])/g, "Щ$1" ],
    // 0.C. слова на -льон
    [ /lyon/g, "льон" ],
    [ /LYON/g, "ЛЬОН" ],
    // ьи
    [ /ьi/g, "i" ],
    [ /Ьi/g, "i" ],
    [ /Ьİ/g, "İ" ],
    // 1. буквы гъ, къ, нъ, дж
    [ /ğ/g, "гъ" ],
    [ /Ğ([aâbcçdefgğhıijklmnñoöpqrsştuüvyz])/g, "Гъ$1" ],
    [ /Ğ([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZ])/g, "ГЪ$1" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZ])Ğ/g, "$1ГЪ" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZЪ])Ğ/g, "$1ГЪ" ],
    [ /q/g, "къ" ],
    [ /Q([aâbcçdefgğhıijklmnñoöpqrsştuüvyz])/g, "Къ$1" ],
    [ /Q([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZ])/g, "КЪ$1" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZ])Q/g, "$1КЪ" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZЪ])Q/g, "$1КЪ" ],
    [ /ñ/g, "нъ" ],
    [ /Ñ([aâbcçdefgğhıijklmnñoöpqrsştuüvyz])/g, "Нъ$1" ],
    [ /Ñ([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZ])/g, "НЪ$1" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZ])Ñ/g, "$1НЪ" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZЪ])Ñ/g, "$1НЪ" ],
    // 2. расставляем Ь после Л
    [ /([eiöüEİÖÜ])l([bcçdfgğhjklmnñpqrstvyz\s"'.,:;!?!\)\-\[<])/g, "$1ль$2" ],
    [ /([EİÖÜ])L([bcçdfgğhjklmnñpqrstvyzBCÇDFGĞHJKLMNÑPQRSŞTVYZ\s"'.,:;!?\)\-\[<])/g, "$1ЛЬ$2" ],
    // 3. обрабатываем ya и ye
    // ya
    [ /([bcçdfgğhjklmnñpqrsştvyzBCÇDFGĞFHJKLMNÑPQRSŞTVYZ])ya/g, "$1ья" ],
    [ /([bcçdfgğhjklmnñpqrsştvyzBCÇDFGĞFHJKLMNÑPQRSŞTVYZ])Y[aA]/g, "$1ЬЯ" ],
    [ /ya/g, "я" ],
    [ /Y[aA]/g, "Я" ],
    // ye
    [ /([bcçdfgğhjklmnñpqrsştvyzBCÇDFGĞFHJKLMNÑPQRSŞTVYZ])ye/g, "$1ье" ],
    [ /([bcçdfgğhjklmnñpqrsştvyzBCÇDFGĞFHJKLMNÑPQRSŞTVYZ])Y[eE]/g, "$1ЬЕ" ],
    [ /ye/g, "е" ],
    [ /Y[eE]/g, "Е" ],
    // 4. расставляем буквы э
    [ /([\s"'\(\)\-.,:;!?>\]//aâeıioöuüаеэяAÂEIİOÖUÜАЕЭЯ])e/g, "$1э" ],
    [ /([\s"'\(\)\-.,:;!?>\]//AÂEIİOÖUÜАЕЭЯ])E/g, "$1Э" ],
    // 5. буквы ё и ю - первый заход
    // ё
    // расставляем мягкие знаки после согласных
    [ /([\s"'\(\)\-.,:;!?>\]/])([yY])ö([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2ö$3ь$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])([yY])Ö([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2Ö$3Ь$4" ],
    // расставляем мягкие знаки перед ё
    [ /([bcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])y[oö]/g, "$1ьё" ],
    [ /([bcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])Y[oöOÖ]/g, "$1ЬЁ" ],
    // обрабатываем остальные вхождения ё
    [ /y[oö]/g, "ё" ],
    [ /Y[oöOÖ]/g, "Ё" ],
    [ /[yY][oöOÖ]/g, "Ё" ],
    // ю
    // расставляем мягкие знаки после согласных
    [ /([\s"'\(\)\-.,:;!?>\]/])([yY])ü([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2ü$3ь$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])([yY])Ü([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2Ü$3Ь$4" ],
    // расставляем мягкие знаки перед ю
    [ /([bcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])y[uü]/g, "$1ью" ],
    [ /([bcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])Y[uüUÜ]/g, "$1ЬЮ" ],
    // обрабатываем остальные вхождения ю
    [ /y[uü]/g, "ю" ],
    [ /Y[uüUÜ]/g, "Ю" ],
    [ /[yY][uüUÜ]/g, "Ю" ],
    // 6. обрабатываем bo'- bu'- и т.д. в первом слоге
    // 6.1. случаи, когда нужен мягкий знак
    // о
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkpşBCGKPŞ])ö([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2о$3ь$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkpşBCGKPŞ])Ö([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2О$3Ь$4" ],
    // у
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkpşBCGKPŞ])ü([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2у$3ь$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkpşBCGKPŞ])Ü([çnrstzÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1$2У$3Ь$4" ],
    // ьа
    [ /ьa/g, "a" ],
    [ /Ьa/g, "a" ],
    [ /ЬA/g, "A" ],
    // 6.2. случаи, когда мягкий знак не нужен
    // о
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkmşBCGKMŞ])ö/g, "$1$2о" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkmşBCGKMŞ])Ö/g, "$1$2О" ],
    // у
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkmşBCGKMŞ])ü/g, "$1$2у" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])([bcgkmşBCGKMŞ])Ü/g, "$1$2У" ],
    // 7. обрабатываем o' и u' в начале слова
    // 7.1. случаи, когда мягкий знак нужен
    // о
    [ /([\s"'\(\)\-.,:;!?>\]/])ö([çnprstzÇNPRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1о$2ь$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ö([çnprstz])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1О$2ь$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ö([ÇNPRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1О$2Ь$3" ],
    // у
    [ /([\s"'\(\)\-.,:;!?>\]/])ü([çnrstzÇNRSTZ])([\s"'..,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1у$2ь$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ü([çnrstz])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1У$2ь$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ü([ÇNRSTZ])([\s"'.,:;!?\)\-\[<aAuUbcçdfgğhjklmnñpqrstvyzBCÇDFGĞFHJKLMNÑPQRSTVYZ])/g, "$1У$2Ь$3" ],
    // 7.2. случаи, когда мягкий знак не нужен
    // о
    [ /([\s"'\(\)\-.,:;!?>\]/])ö/g, "$1о" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ö/g, "$1О" ],
    // у
    [ /([\s"'\(\)\-.,:;!?>\]/])ü/g, "$1у" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Ü/g, "$1У" ],
    // 8. все оставшиеся вхождения букв a, e, o, o', u, u', y
    [ /a/g, "а" ],
    [ /A/g, "А" ],
    [ /e/g, "е" ],
    [ /E/g, "Е" ],
    [ /o/g, "о" ],
    [ /O/g, "О" ],
    [ /ö/g, "ё" ],
    [ /Ö/g, "Ё" ],
    [ /u/g, "у" ],
    [ /U/g, "У" ],
    [ /ü/g, "ю" ],
    [ /Ü/g, "Ю" ],
    [ /y/g, "й" ],
    [ /Y/g, "Й" ],
    // 9. буква c
    [ /c/g, "дж" ],
    [ /C([aâbcçdefgğhıijklmnñoöpqrsştuüvyzаеёйоуэюя])/g, "Дж$1" ],
    [ /C([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZАЕЁЙОУЭЮЯ])/g, "ДЖ$1" ],
    [ /([AÂBCÇDEFGĞHIİJKLMNÑOÖPQRSŞTUÜVYZАЕЁЙОУЭЮЯ])C/g, "$1ДЖ" ],
    // 10. все остальные буквы
    // строчные
    [ /â/g, "я" ],
    [ /b/g, "б" ],
    [ /ç/g, "ч" ],
    [ /d/g, "д" ],
    [ /f/g, "ф" ],
    [ /g/g, "г" ],
    [ /h/g, "х" ],
    [ /ı/g, "ы" ],
    [ /i/g, "и" ],
    [ /j/g, "ж" ],
    [ /k/g, "к" ],
    [ /l/g, "л" ],
    [ /m/g, "м" ],
    [ /n/g, "н" ],
    [ /p/g, "п" ],
    [ /r/g, "р" ],
    [ /s/g, "с" ],
    [ /ş/g, "ш" ],
    [ /t/g, "т" ],
    [ /v/g, "в" ],
    [ /z/g, "з" ],
    // заглавные
    [ /Â/g, "Я" ],
    [ /B/g, "Б" ],
    [ /Ç/g, "Ч" ],
    [ /D/g, "Д" ],
    [ /F/g, "Ф" ],
    [ /G/g, "Г" ],
    [ /H/g, "Х" ],
    [ /I/g, "Ы" ],
    [ /İ/g, "И" ],
    [ /J/g, "Ж" ],
    [ /K/g, "К" ],
    [ /L/g, "Л" ],
    [ /M/g, "М" ],
    [ /N/g, "Н" ],
    [ /P/g, "П" ],
    [ /R/g, "Р" ],
    [ /S/g, "С" ],
    [ /Ş/g, "Ш" ],
    [ /T/g, "Т" ],
    [ /V/g, "В" ],
    [ /V/g, "В" ],
    [ /Z/g, "З" ],
    // 11. убираем сочетания кьк, льл, ньн, рьр, сьс, тьт
    [ /кьк/g, "кк" ],
    [ /К[ьЬ]к/g, "Кк" ],
    [ /КЬК/g, "КК" ],
    [ /льл/g, "лл" ],
    [ /Л[ьЬ]л/g, "Лл" ],
    [ /ЛЬЛ/g, "ЛЛ" ],
    [ /ньн/g, "нн" ],
    [ /Н[ьЬ]н/g, "Нн" ],
    [ /НЬН/g, "НН" ],
    [ /рьр/g, "рр" ],
    [ /Р[ьЬ]р/g, "Рр" ],
    [ /РЬР/g, "РР" ],
    [ /сьс/g, "сс" ],
    [ /С[ьЬ]с/g, "Сс" ],
    [ /СЬС/g, "СС" ],
    [ /тьт/g, "тт" ],
    [ /Т[ьЬ]т/g, "Тт" ],
    [ /ТЬТ/g, "ТТ" ],
    // ьы
    [ /ьы/g, "ы" ],
    [ /Ьы/g, "ы" ],
    [ /ЬЫ/g, "Ы" ],
    // ь..ы
    [ /([^л])ь([гдклмнпрстчш])ы/g, "$1$2ы" ],
    [ /([^Л])Ь([гдклмнпрстчшГДКЛМНПРСТЧШ])ы/g, "$1$2ы" ],
    [ /([^Л])Ь([гдклмнпрстчшГДКЛМНПРСТЧШ])Ы/g, "$1$2Ы" ],
    [ /ь([гкн])ъы/g, "$1ъы" ],
    [ /Ь([ГКН])([ъЪ])ы/g, "$1$2ы" ],
    [ /Ь([ГКН])ЪЫ/g, "$1ЪЫ" ],
    // йь
    [ /йь/g, "й" ],
    [ /ЙЬ/g, "Й" ],
    [ /Йь/g, "Й" ],
    // усть
    [ /([\s"'\(\)\-.,:;!?>\]/])усьт/g, "$1уст" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])Усьт/g, "$1Уст" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])УСЬТ/g, "$1УСТ" ],
    // эки юз
    [ /эки юзь/g, "эки юз" ],
    [ /Эки юзь/g, "Эки юз" ],
    [ /ЭКИ ЮЗЬ/g, "ЭКИ ЮЗ" ],
    // учь юз
    [ /учь юзь/g, "учь юз" ],
    [ /Учь юзь/g, "Учь юз" ],
    [ /УЧЬ ЮЗЬ/g, "УЧЬ ЮЗ" ],
    // дёрт юз
    [ /дёрт юзь/g, "дёрт юз" ],
    [ /Дёрт юзь/g, "Дёрт юз" ],
    [ /ДЁРТ ЮЗЬ/g, "ДЁРТ ЮЗ" ],
    // беш юз
    [ /беш юзь/g, "беш юз" ],
    [ /Беш юзь/g, "Беш юз" ],
    [ /БЕШ ЮЗЬ/g, "БЕШ ЮЗ" ],
    // алты юз
    [ /алты юзь/g, "алты юз" ],
    [ /Алты юзь/g, "Алты юз" ],
    [ /АЛТЫ ЮЗЬ/g, "АЛТЫ ЮЗ" ],
    // еди юз
    [ /еди юзь/g, "еди юз" ],
    [ /Еди юзь/g, "Еди юз" ],
    [ /ЕДИ ЮЗЬ/g, "ЕДИ ЮЗ" ],
    // секиз юз
    [ /секиз юзь/g, "секиз юз" ],
    [ /Секиз юзь/g, "Секиз юз" ],
    [ /СЕКИЗ ЮЗЬ/g, "СЕКИЗ ЮЗ" ],
    // докъуз юз
    [ /докъуз юзь/g, "докъуз юз" ],
    [ /Докъуз юзь/g, "Докъуз юз" ],
    [ /ДОКЪУЗ ЮЗЬ/g, "ДОКЪУЗ ЮЗ" ],
    // римские цифры - временное решение проблемы
    [ /([\s"'\(\)\-.,:;!?>\]/])Ы([\s"'.,:;!?\)\-\[<])/g, "$1I$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1II$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ЫЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1III$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ЫВ([\s"'.,:;!?\)\-\[<])/g, "$1IV$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])В([\s"',:;!?\)\-\[<])/g, "$1V$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ВЫ([\s"'.,:;!?\)\-\[<])/g, "$1VI$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ВЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1VII$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ВЫЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1VIII$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])ЫX([\s"'.,:;!?\)\-\[<])/g, "$1IX$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XЫ([\s"'.,:;!?\)\-\[<])/g, "$1XI$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1XII$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XЫЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1XIII$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XЫВ([\s"'.,:;!?\)\-\[<])/g, "$1XIV$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XВ([\s"'.,:;!?\)\-\[<])/g, "$1XV$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XВЫ([\s"'.,:;!?\)\-\[<])/g, "$1XVI$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XВЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1XVII$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XВЫЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1XVIII$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XЫX([\s"'.,:;!?\)\-\[<])/g, "$1XIX$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XXЫ([\s"'.,:;!?\)\-\[<])/g, "$1XXI$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/])XXЫЫ([\s"'.,:;!?\)\-\[<])/g, "$1XXII$2" ]
]);

},{}],3:[function(require,module,exports){
module.exports = ([
    [ /«/g, "\"" ],
    [ /»/g, "\"" ],
    // 0. словарик
    // алейкум
    [ /алейкум/g, "aleyküm" ],
    [ /Алейкум/g, "Aleyküm" ],
    [ /АЛЕЙКУМ/g, "ALEYKÜM" ],
    // бейуде
    [ /бейуде/g, "Beyüde" ],
    [ /Бейуде/g, "Beyüde" ],
    [ /БЕЙУДЕ/g, "BEYÜDE" ],
    // большевик
    [ /большевик/g, "bolşevik" ],
    [ /Большевик/g, "Bolşevik" ],
    [ /БОЛЬШЕВИК/g, "BOLŞEVİK" ],
    // бозтюс
    [ /бозтюс/g, "boztüs" ],
    [ /Бозтюс/g, "Boztüs" ],
    [ /БОЗТЮС/g, "BOZTÜS" ],
    // борнен
    [ /борнен/g, "bornen" ],
    [ /Борнен/g, "Bornen" ],
    [ /БОРНЕН/g, "BORNEN" ],
    // бублик
    [ /бублик/g, "bublik" ],
    [ /Бублик/g, "Bublik" ],
    [ /БУБЛИК/g, "BUBLİK" ],
    // бугунь
    [ /([\s"'\(\)\-.,:;!?>\]])бугун/g, "$1bugün" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Бугун/g, "$1Bugün" ],
    [ /([\s"'\(\)\-.,:;!?>\]])БУГУН/g, "$1BUGÜN" ],
    // буддизм
    [ /буддизм/g, "buddizm" ],
    [ /Буддизм/g, "Buddizm" ],
    [ /БУДДИЗМ/g, "BUDDİZM" ],
    // буддист
    [ /буддист/g, "buddist" ],
    [ /Буддист/g, "Buddist" ],
    [ /БУДДИСТ/g, "BUDDİST" ],
    // буженина
    [ /буженина/g, "bujenina" ],
    [ /Буженина/g, "Bujenina" ],
    [ /БУЖЕНИНА/g, "BUJENİNA" ],
    // бузкесен
    [ /бузкесен/g, "buzkesen" ],
    [ /Бузкесен/g, "Buzkesen" ],
    [ /БУЗКЕСЕН/g, "BUZKESEN" ],
    // букинист
    [ /букинист/g, "bukinist" ],
    [ /Букинист/g, "Bukinist" ],
    [ /БУКИНИСТ/g, "BUKİNİST" ],
    // буксир
    [ /буксир/g, "buksir" ],
    [ /Буксир/g, "Buksir" ],
    [ /БУКСИР/g, "BUKSİR" ],
    // бульбуль
    [ /бульбуль/g, "bülbül" ],
    [ /Бульбуль/g, "Bülbül" ],
    [ /БУЛЬБУЛЬ/g, "BÜLBÜL" ],
    // бульвар
    [ /бульвар/g, "bulvar" ],
    [ /Бульвар/g, "Bulvar" ],
    [ /БУЛЬВАР/g, "BULVAR" ],
    // бульдог
    [ /бульдог/g, "buldog" ],
    [ /Бульдог/g, "Buldog" ],
    [ /БУЛЬДОГ/g, "BULDOG" ],
    // бульдозер
    [ /бульдозер/g, "buldozer" ],
    [ /Бульдозер/g, "Buldozer" ],
    [ /БУЛЬДОЗЕР/g, "BULDOZER" ],
    // бульон
    [ /бульон/g, "bulyon" ],
    [ /Бульон/g, "Bulyon" ],
    [ /БУЛЬОН/g, "BULYON" ],
    // бумеранг
    [ /бумеранг/g, "bumerang" ],
    [ /Бумеранг/g, "Bumerang" ],
    [ /БУМЕРАНГ/g, "BUMERANG" ],
    // бунен
    [ /бунен/g, "bunen" ],
    [ /буннен/g, "bunnen" ],
    [ /Бунен/g, "Bunen" ],
    [ /Буннен/g, "Bunnen" ],
    [ /БУНЕН/g, "BUNEN" ],
    [ /БУННЕН/g, "BUNNEN" ],
    // бус-бутюн
    [ /бус-бутюн/g, "büs-bütün" ],
    [ /Бус-бутюн/g, "Büs-bütün" ],
    [ /БУС-БУТЮН/g, "BÜS-BÜTÜN" ],
    // бутерброд
    [ /бутерброд/g, "buterbrod" ],
    [ /Бутерброд/g, "Buterbrod" ],
    [ /БУТЕРБРОД/g, "BUTERBROD" ],
    // бутилен
    [ /бутилен/g, "butilen" ],
    [ /Бутилен/g, "Butilen" ],
    [ /БУТИЛЕН/g, "BUTİLEN" ],
    // бутилир
    [ /бутилир/g, "butilir" ],
    [ /Бутилир/g, "Butilir" ],
    [ /БУТИЛИР/g, "BUTİLİR" ],
    // буфер и буфет
    [ /буфе([рт])/g, "bufe$1" ],
    [ /Буфе([рт])/g, "Bufe$1" ],
    [ /БУФЕ([РТ])/g, "BUFE$1" ],
    // буюк
    [ /буюк([^ъ])/g, "büyük$1" ],
    [ /Буюк([^ъ])/g, "Büyük$1" ],
    [ /БУЮК([^Ъ])/g, "BÜYÜK$1" ],
    // формы глагола буюмек
    [ /бую([гдйлмнпрстчшc])(и)/g, "büyü$1$2" ],
    [ /Бую([гдйлмнпрстчшc])(и)/g, "Büyü$1$2" ],
    [ /БУЮ([ГДЙЛМНПРСТЧШС])(И)/g, "BÜYÜ$1$2" ],
    // буюп
    [ /([\s"'\(\)\-.,:;!?>\]])буюп([\s"'.,:;!?\)\-\[<])/g, "$1büyüp$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Буюп([\s"'.,:;!?\)\-\[<])/g, "$1Büyüp$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])БУЮП([\s"'.,:;!?\)\-\[<])/g, "$1BÜYÜP$2" ],
    // буют
    [ /буют([^ыа])/g, "büyüt$1" ],
    [ /Буют([^ыа])/g, "Büyüt$1" ],
    [ /БУЮТ([^ЫА])/g, "BÜYÜT$1" ],
    // гобелен
    [ /гобелен/g, "gobelen" ],
    [ /Гобелен/g, "Gobelen" ],
    [ /ГОБЕЛЕН/g, "GOBELEN" ],
    // гомео
    [ /гомео/g, "gomeo" ],
    [ /Гомео/g, "Gomeo" ],
    [ /ГОМЕО/g, "GOMEO" ],
    // гонъюль
    [ /гонъюл/g, "göñül" ],
    [ /ГОНЪЮЛ/g, "GÖÑÜL" ],
    // горизонт
    [ /горизонт/g, "gorizont" ],
    [ /Горизонт/g, "Gorizont" ],
    [ /ГОРИЗОНТ/g, "GORİZONT" ],
    // госпитал
    [ /госпитал/g, "gospital" ],
    [ /Госпитал/g, "Gospital" ],
    [ /ГОСПИТАЛ/g, "GOSPİTAL" ],
    // готтентот
    [ /готтентот/g, "gottentot" ],
    [ /Готтентот/g, "Gottentot" ],
    [ /ГОТТЕНТОТ/g, "GOTTENTOT" ],
    // гофрир
    [ /гофрир/g, "gofrir" ],
    [ /Гофрир/g, "Gofrir" ],
    [ /ГОФРИР/g, "GOFRİR" ],
    // губерн
    [ /губерн/g, "gubern" ],
    [ /Губерн/g, "Gubern" ],
    [ /ГУБЕРН/g, "GUBERN" ],
    // гуверн
    [ /гуверн/g, "guvern" ],
    [ /Гуверн/g, "Guvern" ],
    [ /ГУВЕРН/g, "GUVERN" ],
    // гугенот
    [ /гугенот/g, "gugenot" ],
    [ /Гугенот/g, "Gugenot" ],
    [ /ГУГЕНОТ/g, "GUGENOT" ],
    // гунях
    [ /гунях/g, "günâh" ],
    [ /Гунях/g, "Günâh" ],
    [ /ГУНЯХ/g, "GÜNÂH" ],
    // гуна
    [ /гуна/g, "güna" ],
    [ /Гуна/g, "Güna" ],
    [ /ГУНА/g, "GÜNA" ],
    // гургуль
    [ /гургуль/g, "gürgül" ],
    [ /Гургуль/g, "Gürgül" ],
    [ /ГУРГУЛЬ/g, "GÜRGÜL" ],
    // гуя
    [ /гуя/g, "güya" ],
    [ /Гуя/g, "Güya" ],
    [ /ГУЯ/g, "GÜYA" ],
    // демирёл
    [ /демирёл/g, "demiryol" ],
    [ /Демирёл/g, "Demiryol" ],
    [ /ДЕМИРЁЛ/g, "DEMİRYOL" ],
    // дёрткуль
    [ /дёрткуль/g, "dörtkül" ],
    [ /Дёрткуль/g, "Dörtkül" ],
    [ /ДЁРТКУЛЬ/g, "DÖRTKÜL" ],
    // ёлнен
    [ /ёлнен/g, "yolnen" ],
    [ /Ёлнен/g, "Yolnen" ],
    [ /ЁЛНЕН/g, "YOLNEN" ],
    // зумбуль
    [ /зумбуль/g, "zümbül" ],
    [ /Зумбуль/g, "Zümbül" ],
    [ /ЗУМБУЛЬ/g, "ZÜMBÜL" ],
    // ковер
    [ /ковер/g, "kover" ],
    [ /Ковер/g, "Kover" ],
    [ /КОВЕР/g, "KOVER" ],
    // кодеин, кодекс, кодификация
    [ /код/g, "kod" ],
    [ /Код/g, "Kod" ],
    [ /КОД/g, "KOD" ],
    // козь
    [ /козь([^я])/g, "köz$1" ],
    [ /Козь([^я])/g, "Köz$1" ],
    [ /КОЗЬ([^Я])/g, "KÖZ$1" ],
    // кой
    [ /кой([\s"'.,:;!?\)\-\[<])/g, "köy$1" ],
    [ /Кой([\s"'.,:;!?\)\-\[<])/g, "Köy$1" ],
    [ /КОЙ([\s"'.,:;!?\)\-\[<])/g, "KÖY$1" ],
    [ /койнинъ([\s"'.,:;!?\)\-\[<])/g, "köyniñ$1" ],
    [ /Койнинъ([\s"'.,:;!?\)\-\[<])/g, "Köyniñ$1" ],
    [ /КОЙНИНЪ([\s"'.,:;!?\)\-\[<])/g, "KÖYNİÑ$1" ],
    [ /койни([\s"'.,:;!?\)\-\[<])/g, "köyni$1" ],
    [ /Койни([\s"'.,:;!?\)\-\[<])/g, "Köyni$1" ],
    [ /КОЙНИ([\s"'.,:;!?\)\-\[<])/g, "KÖYNİ$1" ],
    [ /койге([\s"'.,:;!?\)\-\[<])/g, "köyge$1" ],
    [ /Койге([\s"'.,:;!?\)\-\[<])/g, "Köyge$1" ],
    [ /КОЙГЕ([\s"'.,:;!?\)\-\[<])/g, "KÖYGE$1" ],
    [ /койде([\s"'.,:;!?\)\-\[<])/g, "köyde$1" ],
    [ /Койде([\s"'.,:;!?\)\-\[<])/g, "Köyde$1" ],
    [ /КОЙДЕ([\s"'.,:;!?\)\-\[<])/g, "KÖYDE$1" ],
    [ /койдеки([\s"'.,:;!?\)\-\[<])/g, "köydeki$1" ],
    [ /Койдеки([\s"'.,:;!?\)\-\[<])/g, "Köydeki$1" ],
    [ /КОЙДЕКИ([\s"'.,:;!?\)\-\[<])/g, "KÖYDEKİ$1" ],
    [ /койден([\s"'.,:;!?\)\-\[<])/g, "köyden$1" ],
    [ /Койден([\s"'.,:;!?\)\-\[<])/g, "Köyden$1" ],
    [ /КОЙДЕН([\s"'.,:;!?\)\-\[<])/g, "KÖYDEN$1" ],
    [ /койлю/g, "köylü" ],
    [ /Койлю/g, "Köylü" ],
    [ /КОЙЛЮ/g, "KÖYLÜ" ],
    [ /([\s"'\(\)\-.,:;!?>\]])кою/g, "$1köyü" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кою/g, "$1Köyü" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОЮ/g, "$1KÖYÜ" ],
    // ком-кок
    [ /([\s"'\(\)\-.,:;!?>\]])ком-кок/g, "$1köm-kök" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ком-кок/g, "$1Köm-kök" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОМ-КОК/g, "$1KÖM-KÖK" ],
    // кок
    [ /([\s"'\(\)\-.,:;!?>\]])кок([\s"'\(\)\-.,:;!?>\]])/g, "$1kök$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кок([\s"'\(\)\-.,:;!?>\]])/g, "$1Kök$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОК([\s"'\(\)\-.,:;!?>\]])/g, "$1KÖK$2" ],
    // кокагъач
    [ /кокагъач/g, "kökağaç" ],
    [ /Кокагъач/g, "Kökağaç" ],
    [ /КОКАГЪАЧ/g, "KÖKAĞAÇ" ],
    // кокбаштанкъара
    [ /кокбаштанкъара/g, "kökbaştanqara" ],
    [ /Кокбаштанкъара/g, "Kökbaştanqara" ],
    [ /КОКБАШТАНКЪАРА/g, "KÖKBAŞTANQARA" ],
    // кокгогерджин
    [ /кокгогерджин/g, "kökgögercin" ],
    [ /Кокгогерджин/g, "Kökgögercin" ],
    [ /КОКГОГЕРДЖИН/g, "KÖKGÖGERCİN" ],
    // кокдогъан
    [ /кокдогъан/g, "kökdoğan" ],
    [ /Кокдогъан/g, "Kökdoğan" ],
    [ /КОКДОГЪАН/g, "KÖKDOĞAN" ],
    // коккозь
    [ /коккозь/g, "kökköz" ],
    [ /Коккозь/g, "Kökköz" ],
    [ /КОККОЗЬ/g, "KÖKKÖZ" ],
    // коккозю
    [ /коккозю/g, "kökközü" ],
    [ /Коккозю/g, "Kökközü" ],
    [ /КОККОЗЮ/g, "KÖKKÖZÜ" ],
    // коккоз
    [ /коккоз/g, "kökköz" ],
    [ /Коккоз/g, "Kökköz" ],
    [ /КОККОЗ/g, "KÖKKÖZ" ],
    // коккъузгъун
    [ /коккъузгъун/g, "kökquzğun" ],
    [ /Коккъузгъун/g, "Kökquzğun" ],
    [ /КОККЪУЗГЪУН/g, "KÖKQUZĞUN" ],
    // коклюш
    [ /коклюш/g, "koklüş" ],
    [ /Коклюш/g, "Koklüş" ],
    [ /КОКЛЮШ/g, "KOKLÜŞ" ],
    // кокташ
    [ /кокташ/g, "köktaş" ],
    [ /Кокташ/g, "Köktaş" ],
    [ /КОКТАШ/g, "KÖKTAŞ" ],
    // коктогъан
    [ /коктогъан/g, "köktoğan" ],
    [ /Коктогъан/g, "Köktoğan" ],
    [ /КОКТОГЪАН/g, "KÖKTOĞAN" ],
    // коктотай
    [ /коктотай/g, "köktotay" ],
    [ /Коктотай/g, "Köktotay" ],
    [ /КОКТОТАЙ/g, "KÖKTOTAY" ],
    // коллега и однокоренные
    [ /коллег/g, "kolleg" ],
    [ /Коллега/g, "Kollega" ],
    [ /КОЛЛЕГА/g, "KOLLEGA" ],
    // коллекция, коллектив и однокоренные
    [ /коллек([цт])/g, "kollek$1" ],
    [ /Коллек([цт])/g, "Kollek$1" ],
    [ /КОЛЛЕК([ЦТ])/g, "KOLLEK$1" ],
    // колье
    [ /колье/g, "kolye" ],
    [ /Колье/g, "Kolye" ],
    [ /КОЛЬЕ/g, "KOLYE" ],
    // кольраби
    [ /кольраби/g, "kolrabi" ],
    [ /Кольраби/g, "Kolrabi" ],
    [ /КОЛЬРАБИ/g, "KOLRABİ" ],
    // комбинат и однокоренные
    [ /комби/g, "kombi" ],
    [ /Комби/g, "Kombi" ],
    [ /КОМБИ/g, "KOMBİ" ],
    // комедия, комедиант
    [ /комеди/g, "komedi" ],
    [ /Комеди/g, "Komedi" ],
    [ /КОМЕДИ/g, "KOMEDİ" ],
    // комендант и однокоренные
    [ /коменда/g, "komenda" ],
    [ /Коменда/g, "Komendna" ],
    [ /КОМЕНДА/g, "KOMENDA" ],
    // комета
    [ /комета/g, "kometa" ],
    [ /Комета/g, "Kometa" ],
    [ /КОМЕТА/g, "KOMETA" ],
    // комиссия, комитет, комивояжёр
    [ /коми([вст])/g, "komi$1" ],
    [ /Коми([вст])/g, "Komi$1" ],
    [ /КОМИ([вСТ])/g, "KOMİ$1" ],
    // комментарий, коммивояжёр, коммюнике
    [ /комм/g, "komm" ],
    [ /Комм/g, "Komm" ],
    [ /КОММ/g, "KOMM" ],
    // коммерция и коммерсант
    [ /коммер([сц])/g, "kommer$1" ],
    [ /Комер([сц])/g, "Kommer$1" ],
    [ /КОММЕР([СЦ])/g, "KOMMER$1" ],
    // компенсация, компетенция, компиляция, компьютер
    [ /комп/g, "komp" ],
    [ /Комп/g, "Komp" ],
    [ /КОМП/g, "KOMP" ],
    // конвейер
    [ /конвейер/g, "konveyer" ],
    [ /Конвейер/g, " Konveyer" ],
    [ /КОНВЕЙЕР/g, "KONVEYER" ],
    // конвенция, конверсия, конвергент, конверт
    [ /конве/g, "konve" ],
    [ /Конве/g, "Konve" ],
    [ /КОНВЕ/g, "KONVE" ],
    // конгениаль
    [ /конгени/g, "kongeni" ],
    [ /Конгени/g, "Kongeni" ],
    [ /КОНГЕНИ/g, "KONGENİ" ],
    // конденсатор и однокоренные
    [ /конденс/g, "kondens" ],
    [ /Конденс/g, "Kondens" ],
    [ /КОНДЕНС/g, "KONDENS" ],
    // кондилома
    [ /кондил/g, "kondil" ],
    [ /Кондил/g, "kondil" ],
    [ /КОНДИЛ/g, "KONDİL" ],
    // кондитер
    [ /кондитер/g, "konditer" ],
    [ /Кондитер/g, "konditer" ],
    [ /КОНДИТЕР/g, "KONDİTER" ],
    // коник (конический)
    [ /коник/g, "konik" ],
    [ /Коник/g, "Konik" ],
    [ /КОНИК/g, "KONİK" ],
    // конкистадор
    [ /конкис/g, "konkis" ],
    [ /Конкис/g, "Konkis" ],
    [ /КОНКИС/g, "KONKİS" ],
    // консер
    [ /консерв/g, "konserv" ],
    [ /Консерв/g, "Konserv" ],
    [ /КОНСЕРВ/g, "KONSERV" ],
    // консистенция
    [ /конси/g, "konsi" ],
    [ /Конси/g, "Konsi" ],
    [ /КОНСИ/g, "KONSİ" ],
    // контейнер
    [ /контейнер/g, "konteyner" ],
    [ /Контейнер/g, "Konteyner" ],
    [ /КОНТЕЙНЕР/g, "KONTEYNER" ],
    // континент, контингент, континуум
    [ /конти/g, "konti" ],
    [ /Конти/g, "Konti" ],
    [ /КОНТИ/g, "KONTİ" ],
    // конференция, конфет
    [ /конфе/g, "konfe" ],
    [ /Конфе/g, "Konfe" ],
    [ /КОНФЕ/g, "KONFE" ],
    // конфискация, конфигурация, конфиденциаль
    [ /конфи/g, "konfi" ],
    [ /Конфи/g, "Konfi" ],
    [ /КОНФИ/g, "KONFİ" ],
    // концентрация, концерт
    [ /конце/g, "kontse" ],
    [ /Конце/g, "Kontse" ],
    [ /КОНЦЕ/g, "KONTSE" ],
    // коньки
    [ /коньки/g, "konki" ],
    [ /Коньки/g, "Konki" ],
    [ /КОНЬКИ/g, "KONKİ" ],
    // коньки
    [ /коньяк/g, "konyak" ],
    [ /Коньяк/g, "Konyak" ],
    [ /КОНЬЯК/g, "KONYAK" ],
    // конъюктура, конъюгация, конъюктива
    [ /конъю/g, "konyu" ],
    [ /Конъю/g, "Konyu" ],
    [ /КОНЪЮ/g, "KONYU" ],
    // копирлемек и однокоренные
    [ /копирле/g, "kopirle" ],
    [ /Копирле/g, "Kopirle" ],
    [ /КОПИРЛЕ/g, "KOPİRLE" ],
    // копия
    [ /копия/g, "kopiya" ],
    [ /Копия/g, "Kopiya" ],
    [ /КОПИЯ/g, "KOPİYA" ],
    // коп
    [ /([\s"'\(\)\-.,:;!?>\]])коп([^еёюяЕЁЮЯ])/g, "$1köp$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Коп([^еёюяЕЁЮЯ])/g, "$1Köp$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОП([^еёюяЕЁЮЯ])/g, "$1KÖP$2" ],
    // кордебалет
    [ /корде/g, "korde" ],
    [ /Корде/g, "Korde" ],
    [ /КОРДЕ/g, "KORDE" ],
    // корея
    [ /корея/g, "koreya" ],
    [ /Корея/g, "Koreya" ],
    [ /КОРЕЯ/g, "KOREYA" ],
    // корректор, корреспондент, корреляция
    [ /корре/g, "korre" ],
    [ /Корре/g, "Korre" ],
    [ /КОРРЕ/g, "KORRE" ],
    // кориандр
    [ /кориа/g, "koria" ],
    [ /Кориа/g, "Koria" ],
    [ /КОРИА/g, "KORİA" ],
    // коридор
    [ /коридор/g, "koridor" ],
    [ /Коридор/g, "Koridor" ],
    [ /КОРИДОР/g, "KORİDOR" ],
    // корнишон
    [ /корни/g, "korni" ],
    [ /Корни/g, "Korni" ],
    [ /КОРНИ/g, "KORNİ" ],
    // корнет
    [ /корне/g, "korne" ],
    [ /Корне/g, "Korne" ],
    [ /КОРНЕ/g, "KORNE" ],
    // косметика
    [ /косме/g, "kosme" ],
    [ /Косме/g, "Korsme" ],
    [ /КОСМЕ/g, "KOSME" ],
    // костюм
    [ /костюм/g, "kostüm" ],
    [ /Костюм/g, "Kostüm" ],
    [ /КОСТЮМ/g, "KOSTÜM" ],
    // космик (космический)
    [ /космик/g, "kosmik" ],
    [ /Космик/g, "Kosmik" ],
    [ /КОСМИК/g, "KOSMİK" ],
    // котировка
    [ /котир/g, "kotir" ],
    [ /Котир/g, "Kotir" ],
    [ /КОТИР/g, "KOTİR" ],
    // котлет
    [ /котлет/g, "kotlet" ],
    [ /Котлет/g, "Kotlet" ],
    [ /КОТЛЕТ/g, "KOTLET" ],
    // коше
    [ /коше/g, "köşe" ],
    [ /Коше/g, "Köşe" ],
    [ /КОШЕ/g, "KÖŞE" ],
    // куе
    [ /([\s"'\(\)\-.,:;!?>\]])куе/g, "$1küye" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куе/g, "$1Küye" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУЕ/g, "$1KÜYE" ],
    // кубизм, кубик
    [ /куби/g, "kubi" ],
    [ /Куби/g, "Kubi" ],
    [ /КУБИ/g, "KUBİ" ],
    // кулинар
    [ /кулинар/g, "kulinar" ],
    [ /Кулинар/g, "Kulinar" ],
    [ /КУЛИНАР/g, "KULİNAR" ],
    // кульминация
    [ /кульмин/g, "kulmin" ],
    [ /Кульмин/g, "Kulmin" ],
    [ /КУЛЬМИН/g, "KULMİN" ],
    // культаш
    [ /культаш/g, "kültaş" ],
    [ /Культаш/g, "Kültaş" ],
    [ /КУЛЬТАШ/g, "KÜLTAŞ" ],
    // культе
    [ /культе/g, "külte" ],
    [ /Культе/g, "Külte" ],
    [ /КУЛЬТЕ/g, "KÜLTE" ],
    // культ, культивация
    [ /культ/g, "kult" ],
    [ /Культ/g, "Kult" ],
    [ /КУЛЬТ/g, "KULT" ],
    // курьк
    [ /([\s"'\(\)\-.,:;!?>\]])курк([\s"'.,:;!?\)\-\[<])/g, "$1kürk$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Курк([\s"'.,:;!?\)\-\[<])/g, "$1Kürk$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУРК([\s"'.,:;!?\)\-\[<])/g, "$1KÜRK$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куркке/g, "$1kürkke" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куркке/g, "$1Kürkke" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУРККЕ/g, "$1KÜRKKE" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куркни/g, "$1kürkni" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куркни/g, "$1Kürkni" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУРКНИ/g, "$1KÜRKNİ" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куркте/g, "$1kürkte" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куркте/g, "$1Kürkte" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУРКТЕ/g, "$1KÜRKTE" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куркчи/g, "$1kürkçi" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куркчи/g, "$1Kürkçi" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУРКЧИ/g, "$1KÜRKÇİ" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куркчю/g, "$1kürkçü" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куркчю/g, "$1Kürkçü" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУРКЧЮ/g, "$1KÜRKÇÜ" ],
    // курсив
    [ /курсив/g, "kursiv" ],
    [ /Курсив/g, "Kursiv" ],
    [ /КУРСИВ/g, "KURSİV" ],
    // кушетка
    [ /кушет/g, "kuşet" ],
    [ /Кушет/g, "Kuşet" ],
    [ /КУШЕТ/g, "KUŞET" ],
    // кушкулемек и однокоренные
    [ /кушку/g, "küşkü" ],
    [ /Кушку/g, "Küşkü" ],
    [ /КУШКУ/g, "KÜŞKÜ" ],
    // куюк
    [ /куюк/g, "küyük" ],
    [ /Куюк/g, "Küyük" ],
    [ /КУЮК/g, "KÜYÜK" ],
    // медьюн
    [ /медьюн/g, "medyun" ],
    [ /Медьюн/g, "Medyun" ],
    [ /МЕДЬЮН/g, "MEDYUN" ],
    // месуль
    [ /месуль/g, "mesül" ],
    [ /Месуль/g, "Mesül" ],
    [ /МЕСУЛЬ/g, "MESÜL" ],
    [ /месули/g, "mesüli" ],
    [ /Месули/g, "Mesüli" ],
    [ /МЕСУЛИ/g, "MESÜLİ" ],
    // мефкуре
    [ /мефкуре/g, "mefküre" ],
    [ /Мефкуре/g, "Mefküre" ],
    [ /МЕФКУРЕ/g, "MEFKÜRE" ],
    // могедек
    [ /могедек/g, "mögedek" ],
    [ /Могедек/g, "Mögedek" ],
    [ /МОГЕДЕК/g, "MÖGEDEK" ],
    // мумиё
    [ /мумиё/g, "mumiyo" ],
    [ /Мумиё/g, "Mumiyo" ],
    [ /МУМИЁ/g, "MUMİYO" ],
    // мумификация
    [ /мумиф/g, "mumif" ],
    [ /Мумиф/g, "Mumif" ],
    [ /МУМИФ/g, "MUMİF" ],
    // муурь
    [ /муур/g, "müür" ],
    [ /Муур/g, "Müür" ],
    [ /МУУР/g, "MÜÜR" ],
    // муче
    [ /муче/g, "müçe" ],
    [ /Муче/g, "Müçe" ],
    [ /МУЧЕ/g, "MÜÇE" ],
    // муюз
    [ /муюз/g, "müyüz" ],
    [ /Муюз/g, "Müyüz" ],
    [ /МУЮЗ/g, "MÜYÜZ" ],
    // нумюне
    [ /нумюне/g, "nümüne" ],
    [ /Нумюне/g, "Nümüne" ],
    [ /НУМЮНЕ/g, "NÜMÜNE" ],
    // обелиск
    [ /обел/g, "obel" ],
    [ /Обел/g, "Obel" ],
    [ /ОБЕЛ/g, "OBEL" ],
    // обертон
    [ /обер/g, "ober" ],
    [ /Обер/g, "Ober" ],
    [ /ОБЕР/g, "OBER" ],
    // облигация
    [ /обли/g, "obli" ],
    [ /Обли/g, "Obli" ],
    [ /ОБЛИ/g, "OBLİ" ],
    // обсерватория
    [ /обсе/g, "obse" ],
    [ /Обсе/g, "Obse" ],
    [ /ОБСЕ/g, "OBSE" ],
    // обтюратор
    [ /обт/g, "obt" ],
    [ /Обт/g, "Obt" ],
    [ /ОБТ/g, "OBT" ],
    // огнемёт
    [ /огне/g, "ogne" ],
    [ /Огне/g, "Ogne" ],
    [ /ОГНЕ/g, "OGNE" ],
    // ог
    [ /(["\s(-])ог([^ъ])/g, "$1öг$2" ],
    [ /(["\s(-])Ог([^ъ])/g, "$1Öг$2" ],
    [ /(["\s(-])ОГ([^Ъ])/g, "$1ÖГ$2" ],
    // одеколон
    [ /одеколон/g, "odekolon" ],
    [ /Одеколон/g, "Odekolon" ],
    [ /ОДЕКОЛОН/g, "ODEKOLON" ],
    // озюязар
    [ /озюя/g, "özüya" ],
    [ /Озюя/g, "Özüya" ],
    [ /ОЗЮЯ/g, "ÖZÜYA" ],
    // океан
    [ /океан/g, "okean" ],
    [ /Океан/g, "Okean" ],
    [ /ОКЕАН/g, "OKEAN" ],
    // оксиген
    [ /окси/g, "oksi" ],
    [ /Окси/g, "Oksi" ],
    [ /ОКСИ/g, "OKSİ" ],
    // октет
    [ /октет/g, "oktet" ],
    [ /Октет/g, "Oktet" ],
    [ /ОКТЕТ/g, "OKTET" ],
    // олеандр
    [ /олеа/g, "olea" ],
    [ /Олеа/g, "Olea" ],
    [ /ОЛЕА/g, "OLEA" ],
    // олеин
    [ /олеи/g, "olei" ],
    [ /Олеи/g, "Olei" ],
    [ /ОЛЕИ/g, "OLEİ" ],
    // …ольчер
    [ /ольчер/g, "ölçer" ],
    [ /ОЛЬЧЕР/g, "ÖLÇER" ],
    // оливин
    [ /олив/g, "oliv" ],
    [ /Олив/g, "Oliv" ],
    [ /ОЛИВ/g, "OLİV" ],
    // олигарх, олигофрен
    [ /олиг/g, "olig" ],
    [ /Олиг/g, "Olig" ],
    [ /ОЛИГ/g, "OLİG" ],
    // олифа
    [ /олиф/g, "olif" ],
    [ /Олиф/g, "Olif" ],
    [ /ОЛИФ/g, "OLİF" ],
    // олимп
    [ /олимп/g, "olimp" ],
    [ /Олимп/g, "Olimp" ],
    [ /ОЛИМП/g, "OLİMP" ],
    // омлет
    [ /омле/g, "omle" ],
    [ /Омле/g, "Omle" ],
    [ /ОМЛЕ/g, "OMLE" ],
    // онен
    [ /онен/g, "onen" ],
    [ /оннен/g, "onnen" ],
    [ /Онен/g, "Onen" ],
    [ /Оннен/g, "Onnen" ],
    [ /ОНЕН/g, "ONEN" ],
    [ /ОННЕН/g, "ONNEN" ],
    // операция, оператор, опера
    [ /опера/g, "opera" ],
    [ /Опера/g, "Opera" ],
    [ /ОПЕРА/g, "OPERA" ],
    // оперетта
    [ /опере/g, "opere" ],
    [ /Опере/g, "Opere" ],
    [ /ОПЕРЕ/g, "OPERE" ],
    // оптималь, оптимист, оптимизм
    [ /оптим/g, "optim" ],
    [ /Оптим/g, "Optim" ],
    [ /ОПТИМ/g, "OPTİM" ],
    // опция и однокоренные
    [ /опция/g, "optsiya" ],
    [ /Опция/g, "Optsiya" ],
    [ /ОПЦИЯ/g, "OPTSİYA" ],
    [ /опци/g, "optsi" ],
    [ /Опци/g, "Optsi" ],
    [ /ОПЦИ/g, "OPTSİ" ],
    // орбита
    [ /орби/g, "orbi" ],
    [ /Орби/g, "Orbi" ],
    [ /ОРБИ/g, "ORBİ" ],
    // орден и ордер
    [ /([\s"'\(\)\-.,:;!?>\]])орде([нр])/g, "$1orde$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Орде([нр])/g, "$1Orde$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ОРДЕ([НР])/g, "$1ORDE$2" ],
    // ордината, ординатура
    [ /ордин/g, "ordin" ],
    [ /Ордин/g, "Ordin" ],
    [ /ОРДИН/g, "ORDİN" ],
    // ореанда
    [ /ореа/g, "orea" ],
    [ /Ореа/g, "Orea" ],
    [ /ОРЕА/g, "OREA" ],
    // ориентир
    [ /ориент/g, "oriyent" ],
    [ /Ориент/g, "Oriyent" ],
    [ /ОРИЕНТ/g, "ORİYENT" ],
    // оркестр
    [ /оркестр/g, "orkestr" ],
    [ /Оркестр/g, "Orkestr" ],
    [ /ОРКЕСТР/g, "ORKESTR" ],
    // орнитолог
    [ /орни/g, "orni" ],
    [ /Орни/g, "Orni" ],
    [ /ОРНИ/g, "ORNİ" ],
    // орхидея
    [ /орхи/g, "orhi" ],
    [ /Орхи/g, "Orhi" ],
    [ /ОРХИ/g, "ORHİ" ],
    // осциллограф
    [ /осци/g, "ostsi" ],
    [ /Осци/g, "Ostsi" ],
    [ /ОСЦИ/g, "OSTSİ" ],
    // офис
    [ /офис/g, "ofis" ],
    [ /Офис/g, "Ofis" ],
    [ /ОФИС/g, "OFİS" ],
    // офицер, официант, официаль
    [ /офиц/g, "ofits" ],
    [ /Офиц/g, "Ofits" ],
    [ /ОФИЦ/g, "OFİTS" ],
    // офсет
    [ /офсет/g, "ofset" ],
    [ /Офсет/g, "Ofset" ],
    [ /ОФСЕТ/g, "OFSET" ],
    // очерк
    [ /очерк/g, "oçerk" ],
    [ /Очерк/g, "Oçerk" ],
    [ /ОЧЕРК/g, "OÇERK" ],
    // оюннен
    [ /оюннен/g, "oyunnen" ],
    [ /Оюннен/g, "Oyunnen" ],
    [ /ОЮННЕН/g, "OYUNNEN" ],
    // потюк
    [ /потюк/g, "pötük" ],
    [ /Потюк/g, "Pötük" ],
    [ /ПОТЮК/g, "PÖTÜK" ],
    // пуклемек
    [ /пукле/g, "pükle" ],
    [ /Пукле/g, "Pükle" ],
    [ /ПУКЛЕ/g, "PÜKLE" ],
    // пуркюмек
    [ /пуркю/g, "pürkü" ],
    [ /Пуркю/g, "Pürkü" ],
    [ /ПУРКЮ/g, "PÜRKÜ" ],
    // пурумют
    [ /пурумют/g, "purümüt" ],
    [ /Пурумют/g, "Purümüt" ],
    [ /ПУРУМЮТ/g, "PURÜMÜT" ],
    // пускюль
    [ /пускюл/g, "püskül" ],
    [ /Пускюл/g, "Püskül" ],
    [ /ПУСКЮЛ/g, "PÜSKÜL" ],
    [ /пуськюл/g, "püskül" ],
    [ /Пуськюл/g, "Püskül" ],
    [ /ПУСЬКЮЛ/g, "PÜSKÜL" ],
    [ /пускул/g, "püskül" ],
    [ /Пускул/g, "Püskül" ],
    [ /ПУСКУЛ/g, "PÜSKÜL" ],
    // пуськю
    [ /пуськю/g, "püskü" ],
    [ /Пуськю/g, "Püskü" ],
    [ /ПУСЬКЮ/g, "PÜSKÜ" ],
    [ /пускю/g, "püskü" ],
    [ /Пускю/g, "Püskü" ],
    [ /ПУСКЮ/g, "PÜSKÜ" ],
    // пускюрмек
    [ /пускюр/g, "püskür" ],
    [ /Пускюр/g, "Püskür" ],
    [ /ПУСКЮР/g, "PÜSKÜR" ],
    [ /пуськюр/g, "püskür" ],
    [ /Пуськюр/g, "Püskür" ],
    [ /ПУСЬКЮР/g, "PÜSKÜR" ],
    [ /пускур/g, "püskür" ],
    [ /Пускур/g, "Püskür" ],
    [ /ПУСКУР/g, "PÜSKÜR" ],
    // пусюр
    [ /пусюр/g, "püsür" ],
    [ /Пусюр/g, "Püsür" ],
    [ /ПУСЮР/g, "PÜSÜR" ],
    // пуфлемек
    [ /пуфле/g, "püfle" ],
    [ /Пуфле/g, "Püfle" ],
    [ /ПУФЛЕ/g, "PÜFLE" ],
    // сурет
    [ /сурет/g, "süret" ],
    [ /Сурет/g, "Süret" ],
    [ /СУРЕТ/g, "SÜRET" ],
    // увертюра
    [ /увертюра/g, "uvertüra" ],
    [ /Увертюра/g, "Uvertüra" ],
    [ /УВЕРТЮРА/g, "UVERTÜRA" ],
    // углевод, углеводород и т.п.
    [ /угле/g, "ugle" ],
    [ /Угле/g, "Ugle" ],
    [ /Угле/g, "UGLE" ],
    // узвий
    [ /узвий/g, "uzviy" ],
    [ /Узвий/g, "Uzviy" ],
    [ /УЗВИЙ/g, "UZVİY" ],
    // улица
    [ /улица/g, "ulitsa" ],
    [ /Улица/g, "Ulitsa" ],
    [ /УЛИЦА/g, "ULİTSA" ],
    // ультиматум и однокоренные
    [ /ультимат/g, "ultimat" ],
    [ /Ультимат/g, "Ultimat" ],
    [ /УЛЬТИМАТ/g, "ULTIMAT" ],
    // ультра
    [ /ультра/g, "ultra" ],
    [ /Ультра/g, "Ultra" ],
    [ /УЛЬТРА/g, "ULTRA" ],
    // уника
    [ /([\s"'\(\)\-.,:;!?>\]])уник/g, "$1unik" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Уник/g, "$1Unik" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УНИК/g, "$1UNİK" ],
    // универcаль, универмаг, университет
    [ /универ/g, "univer" ],
    [ /Универ/g, "Univer" ],
    [ /УНИВЕР/g, "UNİVER" ],
    // унисон
    [ /унис/g, "unis" ],
    [ /Унис/g, "Unis" ],
    [ /УНИС/g, "UNİS" ],
    // унитаз
    [ /унит/g, "unit" ],
    [ /Унит/g, "Unit" ],
    [ /УНИТ/g, "UNİT" ],
    // унификация, униформа
    [ /униф/g, "unif" ],
    [ /Униф/g, "Unif" ],
    [ /УНИФ/g, "UNİF" ],
    // унтер
    [ /([\s"'\(\)\-.,:;!?>\]])унтер/g, "$1unter" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Унтер/g, "$1Unter" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УНТЕР/g, "$1UNTER" ],
    // урьян
    [ /урьян/g, "uryan" ],
    [ /Урьян/g, "Uryan" ],
    [ /УРЬЯН/g, "URYAN" ],
    // утилизация
    [ /утил/g, "util" ],
    [ /Утил/g, "Util" ],
    [ /УТИЛ/g, "UTİL" ],
    // джонк
    [ /джонкю/g, "cönkü" ],
    [ /Джонкю/g, "Cönkü" ],
    [ /ДЖОНКЮ/g, "CÖNKÜ" ],
    [ /джонк([^ъ])/g, "cönk$1" ],
    [ /Джонк([^ъ])/g, "Cönk$1" ],
    [ /ДЖОНК([^Ъ])/g, "CÖNK$1" ],
    // джуньджу
    [ /джуньджу/g, "cüncü" ],
    [ /Джуньджу/g, "Cüncü" ],
    [ /ДЖУНЬДЖУ/g, "CÜNCÜ" ],
    // шовинизм и однокоренные
    [ /шовини/g, "şovini" ],
    [ /Шовини/g, "Şovini" ],
    [ /ШОВИНИ/g, "ŞOVİNİ" ],
    // шоссе
    [ /шоссе/g, "şosse" ],
    [ /Шоссе/g, "Şosse" ],
    [ /ШОССЕ/g, "ŞOSSE" ],
    // шофёр
    [ /шоф[её]р/g, "şoför" ],
    [ /Шоф[её]р/g, "Şoför" ],
    [ /ШОФ[ЕЁ]Р/g, "ŞOFÖR" ],
    // шунен
    [ /шунен/g, "şunen" ],
    [ /шуннен/g, "şunnen" ],
    [ /Шунен/g, "Şunen" ],
    [ /Шуннен/g, "Şunnen" ],
    [ /ШУНЕН/g, "ŞUNEN" ],
    [ /ШУННЕН/g, "ŞUNNEN" ],
    // шунчюн
    [ /шунчюн/g, "şunçün" ],
    [ /шунчюн/g, "şunçün" ],
    [ /ШУНЧЮН/g, "ŞUNÇÜN" ],
    // юз
    [ /([\s"'\(\)\-.,:;!?>\]])юз([\s"'.,:;!?\)\-\[<])/g, "$1yüz$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Юз([\s"'.,:;!?\)\-\[<])/g, "$1Yüz$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ЮЗ([\s"'.,:;!?\)\-\[<])/g, "$1YÜZ$2" ],
    // юзбашы
    [ /([\s"'\(\)\-.,:;!?>\]])юзбашы/g, "$1yüzbaşı" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Юзбашы/g, "$1Yüzbaşı" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ЮЗБАШЫ/g, "$1YÜZBAŞI" ],
    // юзйыллыкъ
    [ /([\s"'\(\)\-.,:;!?>\]])юзйыл/g, "$1yüzyıl" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Юзйыл/g, "$1Yüzyıl" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ЮЗЙЫЛ/g, "$1YÜZYIL" ],
    // юк
    [ /([\s"'\(\)\-.,:;!?>\]])юк([^ъ])/g, "$1yüк$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Юк([^ъ])/g, "$1Yüк$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ЮК([^Ъ])/g, "$1YÜК$2" ],
    // юрип
    [ /([\s"'\(\)\-.,:;!?>\]])юрип/g, "$1yürip" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Юрип/g, "$1Yüzrip" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ЮРИП/g, "$1YÜRİP" ],
    // 3-юнджи, 4-юнджи
    [ /([34])-юнджи/g, "$1-ünci" ],
    [ /([34])-ЮНДЖИ/g, "$1-ÜNCİ" ],
    // некоторые глагольные формы на -ама, -алма
    // букама, букалма
    [ /([\s"'\(\)\-.,:;!?>\]])букама/g, "$1bükama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])букалма/g, "$1bükalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Букама/g, "$1Bükama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Букалма/g, "$1Bükalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])БУКАМА/g, "$1BÜKAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])БУКАМА/g, "$1BÜKALMA" ],
    // комама, комалма
    [ /([\s"'\(\)\-.,:;!?>\]])комама/g, "$1kömama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])комалма/g, "$1kömalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Комама/g, "$1Kömama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Комалма/g, "$1Kömalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОМАМА/g, "$1KÖMAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОМАМА/g, "$1KÖMALMA" ],
    // корама, коралма
    [ /([\s"'\(\)\-.,:;!?>\]])корама/g, "$1körama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])коралма/g, "$1köralma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Корама/g, "$1Körama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Коралма/g, "$1Köralma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОРАМА/g, "$1KÖRAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОРАМА/g, "$1KÖRALMA" ],
    // кочама, кочалма
    [ /([\s"'\(\)\-.,:;!?>\]])кочама/g, "$1köçama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])кочалма/g, "$1köçalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кочама/g, "$1Köçama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кочалма/g, "$1Köçalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОЧАМА/g, "$1KÖÇAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КОЧАМА/g, "$1KÖÇALMA" ],
    // куяма, куялма
    [ /([\s"'\(\)\-.,:;!?>\]])куяма/g, "$1küyama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куялма/g, "$1küyalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куяма/g, "$1Küyama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куялма/g, "$1Küyalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУЯАМА/g, "$1KÜYAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУЯАМА/g, "$1KÜYALMA" ],
    // кулама, кулалма
    // ver=/([\s"'\(\)\-.,:;!?>\]])кулама/g; //str=str.replace(ver, "$1külama")
    // ver=/([\s"'\(\)\-.,:;!?>\]])кулама/g, "$1külama" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])кулалма/g; //str=str.replace(ver, "$1külalma")
    // ver=/([\s"'\(\)\-.,:;!?>\]])кулалма/g, "$1külalma" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])Кулама/g; //str=str.replace(ver, "$1Külama")
    // ver=/([\s"'\(\)\-.,:;!?>\]])Кулама/g, "$1Külama" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])Кулалма/g; //str=str.replace(ver, "$1Külalma")
    // ver=/([\s"'\(\)\-.,:;!?>\]])Кулалма/g, "$1Külalma" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])КУЛАМА/g; //str=str.replace(ver, "$1KÜLAMA")
    // ver=/([\s"'\(\)\-.,:;!?>\]])КУЛАМА/g, "$1KÜLAMA" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])КУЛАМА/g; //str=str.replace(ver, "$1KÜLALMA")
    // ver=/([\s"'\(\)\-.,:;!?>\]])КУЛАМА/g, "$1KÜLALMA" ],
    // кусама, кусалма
    [ /([\s"'\(\)\-.,:;!?>\]])кусама/g, "$1küsama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])кусалма/g, "$1küsalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кусама/g, "$1Küsama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кусалма/g, "$1Küsalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУСАМА/g, "$1KÜSAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУСАМА/g, "$1KÜSALMA" ],
    // кутама, куталма
    [ /([\s"'\(\)\-.,:;!?>\]])кутама/g, "$1kütama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])куталма/g, "$1kütalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Кутама/g, "$1Kütama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Куталма/g, "$1Kütalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУТАМА/g, "$1KÜTAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])КУТАМА/g, "$1KÜTALMA" ],
    // опама, опалма
    [ /([\s"'\(\)\-.,:;!?>\]])опама/g, "$1öpama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])опалма/g, "$1öpalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Опама/g, "$1Öpama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Опалма/g, "$1Öpalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ОПАМА/g, "$1ÖPAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ОПАМА/g, "$1ÖPALMA" ],
    // осама, осалма
    [ /([\s"'\(\)\-.,:;!?>\]])осама/g, "$1ösama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])осалма/g, "$1ösalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Осама/g, "$1Ösama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Осалма/g, "$1Ösalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ОСАМА/g, "$1ÖSAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ОСАМА/g, "$1ÖSALMA" ],
    // отама, оталма
    // ver=/([\s"'\(\)\-.,:;!?>\]])отама/g; //str=str.replace(ver, "$1ötama")
    // ver=/([\s"'\(\)\-.,:;!?>\]])отама/g, "$1ötama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])оталма/g, "$1ötalma" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])Отама/g; //str=str.replace(ver, "$1Ötama")
    // ver=/([\s"'\(\)\-.,:;!?>\]])Отама/g, "$1Ötama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Оталма/g, "$1Ötalma" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])ОТАМА/g; //str=str.replace(ver, "$1ÖTAMA")
    // ver=/([\s"'\(\)\-.,:;!?>\]])ОТАМА/g, "$1ÖTAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ОТАМА/g, "$1ÖTALMA" ],
    // узама, узалма
    // ver=/([\s"'\(\)\-.,:;!?>\]])узама/g; //str=str.replace(ver, "$1üzama")
    // ver=/([\s"'\(\)\-.,:;!?>\]])узама/g, "$1üzama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])узалма/g, "$1üzalma" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])Узама/g; //str=str.replace(ver, "$1Üzama")
    // ver=/([\s"'\(\)\-.,:;!?>\]])Узама/g, "$1Üzama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Узалма/g, "$1BÜzalma" ],
    // ver=/([\s"'\(\)\-.,:;!?>\]])УЗАМА/g; //str=str.replace(ver, "$1ÜZAMA")
    // ver=/([\s"'\(\)\-.,:;!?>\]])УЗАМА/g, "$1ÜZAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УЗАМА/g, "$1ÜZALMA" ],
    // утама, уталма
    [ /([\s"'\(\)\-.,:;!?>\]])утама/g, "$1ütama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])уталма/g, "$1ütalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Утама/g, "$1Ütama" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Уталма/g, "$1BÜtalma" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УТАМА/g, "$1ÜTAMA" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УТАМА/g, "$1ÜTALMA" ],
    // Имена собственные
    [ /аджыумер/g, "acıümer" ],
    [ /Аджыумер/g, "Acıümer" ],
    [ /АДЖЫУМЕР/g, "ACIÜMER" ],
    [ /аджыусеин/g, "acıüsein" ],
    [ /Аджыусеин/g, "Acıüsein" ],
    [ /АДЖЫУСЕИН/g, "ACIÜSEİN" ],
    [ /боливия/g, "boliviya" ],
    [ /Боливия/g, "Boliviya" ],
    [ /БОЛИВИЯ/g, "BOLİVİYA" ],
    [ /борис/g, "boris" ],
    [ /Борис/g, "Boris" ],
    [ /БОРИС/g, "BORİS" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ишунь/g, "$1işün" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ишунь/g, "$1İşün" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ИШУНЬ/g, "$1İŞÜN" ],
    [ /корбекул/g, "körbekül" ],
    [ /Корбекул/g, "Körbekül" ],
    [ /КОРБЕКУЛ/g, "KÖRBEKÜL" ],
    [ /корьбекул/g, "körbekül" ],
    [ /Корьбекул/g, "Körbekül" ],
    [ /КОРЬБЕКУЛ/g, "KÖRBEKÜL" ],
    [ /кореиз/g, "koreiz" ],
    [ /Кореиз/g, "Koreiz" ],
    [ /КОРЕИЗ/g, "KOREİZ" ],
    [ /куркулет/g, "kürkület" ],
    [ /Куркулет/g, "Kürkület" ],
    [ /КУРКУЛЕТ/g, "KÜRKÜLET" ],
    [ /къарагоз/g, "qaragöz" ],
    [ /Къарагоз/g, "Qaragöz" ],
    [ /КЪАРАГОЗ/g, "QARAGÖZ" ],
    [ /къуртумер/g, "qurtümer" ],
    [ /Къуртумер/g, "Qurtümer" ],
    [ /КЪУРТУМЕР/g, "QURTÜMER" ],
    [ /къуртусеин/g, "qurtüsein" ],
    [ /Къуртусеин/g, "Qurtüsein" ],
    [ /КЪУРТУСЕИН/g, "QURTÜSEİN" ],
    [ /марьино/g, "maryino" ],
    [ /Марьино/g, "Maryino" ],
    [ /МАРЬИНО/g, "MARYİNO" ],
    [ /олег/g, "oleg" ],
    [ /Олег/g, "Oleg" ],
    [ /ОЛЕГ/g, "OLEG" ],
    [ /одесса/g, "odessa" ],
    [ /Одесса/g, "Odessa" ],
    [ /ОДЕССА/g, "ODESSA" ],
    [ /одеса/g, "odesa" ],
    [ /Одеса/g, "Odesa" ],
    [ /ОДЕСА/g, "ODESA" ],
    [ /сеитумер/g, "seitümer" ],
    [ /Сеитумер/g, "Seitümer" ],
    [ /СЕИТУМЕР/g, "SEİTÜMER" ],
    [ /сеитусеин/g, "seitüsein" ],
    [ /Сеитусеин/g, "Seitüsein" ],
    [ /СЕИТУСЕИН/g, "SEİTÜSEİN" ],
    [ /сейитумер/g, "seyitümer" ],
    [ /Сейитумер/g, "Seyitümer" ],
    [ /СЕЙИТУМЕР/g, "SEYİTÜMER" ],
    [ /сейитусеин/g, "seyitüsein" ],
    [ /Сейитусеин/g, "Seyitüsein" ],
    [ /СЕЙИТУСЕИН/g, "SEYİTÜSEİN" ],
    [ /щёлкино/g, "şçolkino" ],
    [ /Щёлкино/g, "Şçolkino" ],
    [ /ЩЁЛКИНО/g, "ŞÇOLKİNO" ],
    [ /эмирусеин/g, "emirüsein" ],
    [ /Эмирусеин/g, "Emirüsein" ],
    [ /ЭМИРУСЕИН/g, "EMİRÜSEİN" ],
    [ /юртер/g, "yurter" ],
    [ /Юртер/g, "Yurter" ],
    [ /ЮРТЕР/g, "YURTER" ],
    [ /ющенко/g, "yuşçenko" ],
    [ /Ющенко/g, "Yuşçenko" ],
    [ /ЮЩЕНКО/g, "YUŞÇENKO" ],
    // -ьон
    [ /([^\s])ьон/g, "$1yon" ],
    [ /([^\s])ЬОН/g, "$1YON" ],
    // Я
    [ /([\s"'\(\)\-.,:;!?>\]])Я([\s"'.,:;!?\)\-\[<])/g, "$1Ya$2" ],
    // Ё
    [ /([\s"'\(\)\-.,:;!?>\]])Ё([\s"'.,:;!?\)\-\[<])/g, "$1Yo$2" ],
    // йе
    [ /йе/g, "yye" ],
    [ /ЙЕ/g, "YYE" ],
    // йя
    [ /йя/g, "yya" ],
    [ /ЙЯ/g, "YYA" ],
    // 1. буквы гъ, къ, нъ, дж
    [ /гъ/g, "ğ" ],
    [ /Гъ/g, "Ğ" ],
    [ /ГЪ/g, "Ğ" ],
    [ /къ/g, "q" ],
    [ /Къ/g, "Q" ],
    [ /КЪ/g, "Q" ],
    [ /нъ/g, "ñ" ],
    [ /Нъ/g, "Ñ" ],
    [ /НЪ/g, "Ñ" ],
    [ /дж/g, "c" ],
    [ /Дж/g, "C" ],
    [ /ДЖ/g, "C" ],
    // 2. o', u' первый заход - ё и ю после согласных
    [ /([бвгджзйклмнпрстфхцчшщñcБВГДЖЗЙКЛМНПРСТФХЦЧШЩÑC])ю/g, "$1ü" ],
    [ /([бвгджзйклмнпрстфхцчшщñcБВГДЖЗЙКЛМНПРСТФХЦЧШЩÑC])Ю/g, "$1Ü" ],
    [ /([бвгджзйклмнпрстфхцчшщñcБВГДЖЗЙКЛМНПРСТФХЦЧШЩÑC])ё/g, "$1ö" ],
    [ /([бвгджзйклмнпрстфхцчшщñcБВГДЖЗЙКЛМНПРСТФХЦЧШЩÑC])Ё/g, "$1Ö" ],
    // 3. o', u' второй заход
    // буква u'
    // ю
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёюАЫОУЕИЁЮ])ю([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеюэü])/g, "$1yü$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]/АЫОУЕИЁЮ])Ю([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ЬЕЮЭÜ])/g, "$1YÜ$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]/(аыоуеиёюАЫОУЕИЁЮ])ю([бвгджзйклмнпрстфхцчшщcñ])([ьеюэü])/g, "$1yü$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]/(АЫОУЕИЁЮ])Ю([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ЬЕЮЭÜ])/g, "$1YÜ$2$3" ],
    [ /ю([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеюэü])/g, "yü$1$2$3" ],
    [ /Ю([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеюэü])/g, "Yü$1$2$3" ],
    [ /Ю([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([БВГДЖЗЙКЛМНПРСТФХЦЧШЩC,Ñ])([ЬЕЮЭÜ])/g, "YÜ$1$2$3" ],
    [ /ю([бвгджзйклмнпрстфхцчшщcñ])([ьеюэü])/g, "yü$1$2" ],
    [ /Ю([бвгджзйклмнпрстфхцчшщcñ])([ьеюэü])/g, "Yü$1$2" ],
    [ /Ю([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ЬЕЮЭÜ])/g, "YÜ$1$2" ],
    // у и ую
    // после у или ую две согласных
    // строчная у
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкмшcБГКМCШ])у([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1$2ü$3$4$5" ],
    [ /([\s"'\(\)\-.,:;!?>\]])у([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1ü$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ую([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1üyü$2$3$4" ],
    // заглавная У
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкмшcБГКМШC])У([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1$2Ü$3$4$5" ],
    [ /([\s"'\(\)\-.,:;!?>\]])У([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1Ü$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ую([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1Üyü$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УЮ([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1ÜYÜ$2$3$4" ],
    // после у или ую одна согласная
    // строчная у
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкмшcБГКМШC])у([бвгджзйклмнпрстфхцчшщycñ])([ьеёиюэü])/g, "$1$2ü$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])у([бвгджзйклмнпрстфхцчшщycñ])([ьеёиюэü])/g, "$1ü$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ую([бвгджзйклмнпрстфхцчшщycñ])([ьеёиюэü])/g, "$1üyü$2$3" ],
    // заглавная У
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкмшcБГКМШC])У([бвгджзйклмнпрстфхцчшщcñyБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюüэЬЕЁИЮЭÜ])/g, "$1$2Ü$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])У([бвгджзйклмнпрстфхцчшщcñyБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюüэЬЕЁИЮЭÜ])/g, "$1Ü$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ую([бвгджзйклмнпрстфхцчшщcñyБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюüэЬЕЁИЮЭÜ])/g, "$1Üyü$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])УЮ([бвгджзйклмнпрстфхцчшщcñyБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюüэЬЕЁИЮЭÜ])/g, "$1ÜYÜ$2$3" ],
    // ещё один заход (не помню уже точно для чего он, но для чего-то нужен)
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкмшcБГКМШC])у([бвгджзйклмнпрстфхцчшщycñ])([ьеёиюэü])/g, "$1$2ü$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])у([бвгджзйклмнпрстфхцчшщycñ])([ьеёиюэü])/g, "$1ü$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкмшcБГКМШC])У([бвгджзйклмнпрстфхцчшщcñyБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюüэЬЕЁИЮЭÜ])/g, "$1$2Ü$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])У([бвгджзйклмнпрстфхцчшщcñyБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюüэЬЕЁИЮЭÜ])/g, "$1Ü$2$3" ],
    // арабские слова на муи- муэ-
    [ /([\s"'\(\)\-.,:;!?>\]])му([иэ])/g, "$1\mü$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Му([иэ])/g, "$1\Mü$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]])МУ([ИЭ])/g, "$1\MÜ$2" ],
    // буква o'
    // ё
    [ /([\s"'\(\)\-.,:;!?>\]])ё([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеюü])/g, "$1yö$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ё([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеюü])/g, "$1Yö$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ё([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ЬЕЮÜ])/g, "$1YÖ$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])ё([бвгджзйклмнпрстфхцчшщcñ])([ьеёюэü])/g, "$1yö$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ё([бвгджзйклмнпрстфхцчшщcñ])([ьеёюэü])/g, "$1Yö$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])Ё([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ЬЕЁЮЭÜ])/g, "$1YÖ$2$3" ],
    // о
    // после о две согласных
    [ /([\s"'\(\)\-.,:;!?>\]])([бгкшcБГКШC])о([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1$2ö$3$4$5" ],
    [ /([\s"'\(\)\-.,:;!?>\]])о([бвгджзйклмнпрстфхцчшщcñ])([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1ö$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])([-\s"'(бгкшcБГКШC])О([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1$2Ö$3$4$5" ],
    // после о одна согласная
    [ /([\s"'\(\)\-.,:;!?>\]])О([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1Ö$2$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])([-\s"'(бгкшcБГКШC])о([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1$2ö$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])о([бвгджзйклмнпрстфхцчшщcñ])([ьеёиюэü])/g, "$1ö$2$3" ],
    [ /([\s"'\(\)\-.,:;!?>\]])([-\s"'(бгкшcБГКШC])О([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1$2Ö$3$4" ],
    [ /([\s"'\(\)\-.,:;!?>\]])О([бвгджзйклмнпрстфхцчшщcñБВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])([ьеёиюэüЬЕЁИЮЭÜ])/g, "$1Ö$2$3" ],
    // 4. o', u' третий заход
    [ /([бвгджзйклмнпрстфхцчшщcñ])ю/g, "$1ü" ],
    [ /([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])ю/g, "$1ü" ],
    [ /([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])Ю/g, "$1Ü" ],
    [ /([бвгджзйклмнпрстфхцчшщcñ])ё/g, "$1ö" ],
    [ /([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])ё/g, "$1ö" ],
    [ /([БВГДЖЗЙКЛМНПРСТФХЦЧШЩCÑ])Ё/g, "$1Ö" ],
    // 5. o', u' четвёртый заход
    [ /([ьеёюэöü])ю/g, "$1yü" ],
    [ /([ьеёюэÖÜ])Ю/g, "$1YÜ" ],
    // 6. буквы е и я
    // случаи е -> ye и я -> ya
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяьъöüeАЫОУЕИЁЭЮЯЬЪÖÜE(])е/g, "$1ye" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяьъöüeАЫОУЕИЁЭЮЯЬЪÖÜE(])Е([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ\s"'.,:;!?\)\-\[<])/g, "$1YE$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяьъöÜeАЫОЯУЕИЁЭЮЯЬЪÖÜE(])Е([абвгдеёжзийклмнопрстуфхцчшщъыьэюяqcğñüö])/g, "$1Ye$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяöÜñqğьъeАЫОУЕИЁЭЮЯÖÜÑQĞЬЪE(])я/g, "$1ya" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяöÜñqğьъeАЫОУЕИЁЭЮЯÖÜÑQĞЬЪE(])Я([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ\s"'.,:;!?\)\-\[<])/g, "$1YA$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяöÜñqğьъeАЫОУЕИЁЭЮЯÖÜÑQĞЬЪE(])Я([абвгдеёжзийклмнопрстуфхцчшщъыьэюяqcğñüö])/g, "$1Ya$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяьъöüaeАЫОУЕИЁЭЮЯЬЪÖÜAE(])е/g, "$1ye" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяьъöüaeАЫОУЕИЁЭЮЯЬЪÖÜAE(])Е([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ\s"'.,:;!?\)\-\[<])/g, "$1YE$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяьъöÜaeАЫОУЕИЁЭЮЯЬЪÖÜAE(])Е([абвгдеёжзийклмнопрстуфхцчшщъыьэюяqcğñüö])/g, "$1Ye$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяöÜñqğьъaeАЫОУЕИЁЭЮЯÖÜÑQĞЬЪAE(])я/g, "$1ya" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяöÜñqğьъaeАЫОУЕИЁЭЮЯÖÜÑQĞЬЪAE(])Я([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ\s"'.,:;!?\)\-\[<])/g, "$1YA$2" ],
    [ /([\s"'\(\)\-.,:;!?>\]/аыоуеиёэюяöÜñqğьъaeАЫОУЕИЁЭЮЯÖÜÑQĞЬЪAE(])Я([абвгдеёжзийклмнопрстуфхцчшщъыьэюяqcğñüö])/g, "$1Ya$2" ],
    // остальные вхождения е и я
    [ /е/g, "e" ],
    [ /Е/g, "E" ],
    [ /я/g, "â" ],
    [ /Я/g, "Â" ],
    // 7. все оставшиеся вхождения о, у, ё, ю
    [ /Ю([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ])/g, "YU$1" ],
    [ /Ю/g, "Yu" ],
    [ /ю/g, "yu" ],
    [ /Ё([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ])/g, "YO$1" ],
    [ /Ё/g, "Yo" ],
    [ /ё/g, "yo" ],
    [ /у/g, "u" ],
    [ /У/g, "U" ],
    [ /о/g, "o" ],
    [ /О/g, "O" ],
    // 8. убираем ь и ъ
    [ /ь/g, "" ],
    [ /Ь/g, "" ],
    [ /ъ/g, "" ],
    [ /Ъ/g, "" ],
    // 9. все остальные буквы
    // заглавные Ц и Щ
    [ /Ц([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ])/g, "TS$1" ],
    [ /Ц/g, "Ts" ],
    [ /Щ([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯQCĞÑÜÖ])/g, "ŞÇ$1" ],
    [ /Щ/g, "Şç" ],
    // строчные
    [ /а/g, "a" ],
    [ /б/g, "b" ],
    [ /в/g, "v" ],
    [ /г/g, "g" ],
    [ /д/g, "d" ],
    [ /ж/g, "j" ],
    [ /з/g, "z" ],
    [ /и/g, "i" ],
    [ /й/g, "y" ],
    [ /к/g, "k" ],
    [ /л/g, "l" ],
    [ /м/g, "m" ],
    [ /н/g, "n" ],
    [ /п/g, "p" ],
    [ /р/g, "r" ],
    [ /с/g, "s" ],
    [ /т/g, "t" ],
    [ /ф/g, "f" ],
    [ /х/g, "h" ],
    [ /ц/g, "ts" ],
    [ /ч/g, "ç" ],
    [ /ш/g, "ş" ],
    [ /щ/g, "şç" ],
    [ /ы/g, "ı" ],
    [ /э/g, "e" ],
    // заглавные
    [ /А/g, "A" ],
    [ /Б/g, "B" ],
    [ /В/g, "V" ],
    [ /Г/g, "G" ],
    [ /Д/g, "D" ],
    [ /Ж/g, "J" ],
    [ /З/g, "Z" ],
    [ /И/g, "İ" ],
    [ /Й/g, "Y" ],
    [ /К/g, "K" ],
    [ /Л/g, "L" ],
    [ /М/g, "M" ],
    [ /Н/g, "N" ],
    [ /П/g, "P" ],
    [ /Р/g, "R" ],
    [ /С/g, "S" ],
    [ /Т/g, "T" ],
    [ /Ф/g, "F" ],
    [ /Х/g, "H" ],
    [ /Ч/g, "Ç" ],
    [ /Ш/g, "Ş" ],
    [ /Ы/g, "I" ],
    [ /Э/g, "E" ]
]);

},{}],4:[function(require,module,exports){
'use strict';

var transliteration = exports;

transliteration.crh = {};

transliteration.crh.fromCyrillic = function(text) {
    return transliterate(text, require('./cyr2crh'));
};

transliteration.crh.toCyrillic = function(text) {
    return transliterate(text, require('./crh2cyr'));
};

function transliterate(text, reMap) {
    text = ' ' + text + ' ';

    for (var i in reMap) {
        text = text.replace(reMap[i][0], reMap[i][1]);
    }

    return text.substring(1, text.length - 1);
}

},{"./crh2cyr":2,"./cyr2crh":3}],5:[function(require,module,exports){
module.exports={
  "name": "transliteration.crh",
  "version": "0.2.1",
  "description": "Transliteration tool for Crimean Tatar language (Latin and Cyrillic alphabets)",
  "main": "./lib/transliteration.crh.js",
  "bin": {
    "crh": "./bin/crh"
  },
  "engines": {
    "node": ">=4"
  },
  "scripts": {
    "browserify": "$(npm bin)/browserify lib/bundle.js --debug | $(npm bin)/exorcist ./dist/transliteration.crh.js.map > ./dist/transliteration.crh.js",
    "uglify": "$(npm bin)/uglifyjs ./dist/transliteration.crh.js --compress --mangle --in-source-map ./dist/transliteration.crh.js.map --source-map ./dist/transliteration.crh.min.js.map --source-map-url transliteration.crh.min.js.map -o ./dist/transliteration.crh.min.js",
    "dist": "npm run browserify && npm run uglify",
    "lint": "$(npm bin)/eslint .",
    "test": "npm run lint && npm run test-unit-coverage",
    "test-browser": "$(npm bin)/karma start --browsers Chrome",
    "test-unit": "$(npm bin)/mocha -u bdd -R spec",
    "test-unit-coverage": "$(npm bin)/istanbul cover $(npm bin)/_mocha -- -u bdd -R spec test/*.test.js"
  },
  "repository": {
    "type": "git",
    "url": "git://github.com/prosvita/crh.transliteration.git"
  },
  "keywords": [
    "transliterate",
    "transliteration",
    "crh",
    "crimeantatar",
    "crimean tatar",
    "qırımtatar",
    "qırım",
    "Къырымтатар",
    "Кримськотатарська",
    "Крымскотатарский",
    "Крымско-татарский"
  ],
  "author": {
    "name": "Pavlo Bashynskyi",
    "email": "levonet@gmail.com",
    "url": "https://github.com/levonet"
  },
  "license": "MIT",
  "bugs": {
    "url": "https://github.com/prosvita/crh.transliteration/issues"
  },
  "homepage": "https://github.com/prosvita/crh.transliteration",
  "dependencies": {
    "commander": "^2.9.0"
  },
  "devDependencies": {
    "browserify": "^13.1.1",
    "chai": "^3.5.0",
    "eslint": "^3.10.1",
    "exorcist": "^0.4.0",
    "istanbul": "^0.4.5",
    "karma": "^1.3.0",
    "karma-chai": "^0.1.0",
    "karma-chrome-launcher": "^2.0.0",
    "karma-coverage": "^1.1.1",
    "karma-firefox-launcher": "^1.0.0",
    "karma-mocha": "^1.3.0",
    "karma-safari-launcher": "^1.0.0",
    "mocha": "^3.1.2",
    "uglify-js": "^2.7.4"
  },
  "files": [
    "bin",
    "dist",
    "lib"
  ]
}

},{}]},{},[1])
//# sourceMappingURL=transliteration.crh.js.map
